[
  {
    "id": "pebble-beach",
    "name": "Pebble Beach Golf Links",
    "description": "Iconic coastal course with stunning ocean views",
    "location": "Pebble Beach, California",
    "rating": 4.9,
    "category": "recent",
    "batch": "Absolute Icons & Major Venues",
    "type": "coastal",
    "blurb": [
      "Jack Neville and Douglas Grant's 1919 design occupies the most stunning oceanfront property in golf on California's Monterey Peninsula. The course's genius is its routing, which brings players to the cliffs of Carmel Bay for dramatic sequences at holes 4-10 and the iconic finish from the par-3 17th over the ocean to the par-5 18th along the shore. The small, sloping poa annua greens are fiercely defended by coastal winds and deep bunkers.",
      "The experience is a blend of breathtaking beauty and demanding championship golf, where club selection changes by the minute with the Pacific breeze. It has hosted six U.S. Opens, with winners like Jack Nicklaus, Tom Watson, and Tiger Woods claiming historic victories. Golfers remember the visceral feeling of hitting shots where the land ends, making it a public-access pilgrimage that lives up to its monumental reputation."
    ],
    "architect": "Jack Nicklaus",
    "yardage": 7100,
    "continent": "North America",
    "latitude": 36.5681,
    "longitude": -121.9494,
    "isStudio": true,
    "hasStandardVersion": true,
    "studioFeatures": {
      "mappingType": "Lidar",
      "resolution": "True 4K Native",
      "physics": "Advanced Slope Engine",
      "accuracy": "Sub-Centimeter",
      "fileSize": "5 GB"
    },
    "standardFeatures": {
      "mappingType": "Satellite",
      "resolution": "HD (1080p)",
      "physics": "Standard Terrain Model",
      "accuracy": "1m",
      "fileSize": "500 MB"
    }
  },
  {
    "id": "augusta-national",
    "name": "Augusta National Golf Club",
    "description": "Home of The Masters Tournament",
    "location": "Augusta, Georgia",
    "rating": 5.0,
    "category": "recent",
    "batch": "Absolute Icons & Major Venues",
    "type": "championship",
    "blurb": [
      "Founded by Bobby Jones and Alister MacKenzie in 1933, Augusta National is a meticulously crafted sanctuary in the Georgia pines, far removed from its origins as a plant nursery. Its architectural character is defined by vast, undulating greens, strategic risk-reward par-5s, and iconic landmarks like Amen Corner (holes 11, 12, and 13). The course is a living work of art, with each hole named after a flowering tree or shrub, and its pristine, televised beauty is the result of relentless year-round conditioning.",
      "Play experience is defined by the tournament pins each April; the course members enjoy is notably different from the penalizing setup for The Masters. The challenge lies in complex green contours and the intense pressure of the tournament's history. As the permanent home of The Masters since 1934, it is golf's most revered annual theater. Golfers remember it for its unparalleled atmosphere, tradition, and the singular pursuit of conquering its second-nine charges."
    ],
    "architect": "Alister MacKenzie",
    "established": 1934,
    "yardage": 6950,
    "continent": "North America",
    "latitude": 33.503,
    "longitude": -82.0199,
    "isStudio": false,
    "hasStandardVersion": true,
    "studioFeatures": {
      "mappingType": "Lidar",
      "resolution": "True 4K Native",
      "physics": "Advanced Slope Engine",
      "accuracy": "Sub-Centimeter",
      "fileSize": "5 GB"
    },
    "standardFeatures": {
      "mappingType": "Satellite",
      "resolution": "HD (1080p)",
      "physics": "Standard Terrain Model",
      "accuracy": "1m",
      "fileSize": "500 MB"
    }
  },
  {
    "id": "st-andrews",
    "name": "St. Andrews Old Course",
    "description": "The Home of Golf - historic links course",
    "location": "St. Andrews, Scotland",
    "rating": 4.8,
    "category": "recommended",
    "batch": "Absolute Icons & Major Venues",
    "type": "links",
    "blurb": [
      "The Old Course is the ancestral home of golf, with play documented since the 1400s on public land in Fife. Its ancient, rumpled topography features double greens, seven shared by two holes, and strategic lines over low stone walls and the Swilcan Burn. The most famous features are the vast, hidden Hell Bunker on the par-5 14th and the Road Hole 17th, with its blind tee shot over a railway shed and a green hard against a stone path.",
      "Playing the Old Course is a walk through history, requiring imaginative shots along the firm, fast ground. Its difficulty is dictated by the wind off St. Andrews Bay. As the host of 30 Open Championships, it has crowned champions from Old Tom Morris to Tiger Woods. It is memorable because it remains a public links, accessible to all, where one plays the same timeless ground as every golfing legend."
    ],
    "architect": "Old Tom Morris",
    "yardage": 7450,
    "continent": "Europe",
    "latitude": 56.3398,
    "longitude": -2.7967,
    "isStudio": false,
    "hasStandardVersion": true,
    "studioFeatures": {
      "mappingType": "Lidar",
      "resolution": "True 4K Native",
      "physics": "Advanced Slope Engine",
      "accuracy": "Sub-Centimeter",
      "fileSize": "5 GB"
    },
    "standardFeatures": {
      "mappingType": "Satellite",
      "resolution": "HD (1080p)",
      "physics": "Standard Terrain Model",
      "accuracy": "1m",
      "fileSize": "500 MB"
    }
  },
  {
    "id": "pinehurst-no2",
    "name": "Pinehurst No. 2",
    "description": "Classic American design by Donald Ross",
    "location": "Pinehurst, North Carolina",
    "rating": 4.7,
    "category": "recommended",
    "batch": "Absolute Icons & Major Venues",
    "type": "championship",
    "blurb": [
      "Donald Ross's masterwork (opened 1907, refined for decades) embodies strategic design in the sandy soil of North Carolina. Famous for its crowned, turtleback greens and the absence of rough—replaced by natural wiregrass and sandy waste areas—the course demands precise approach shots and creative recovery play. The par-4 5th and the long par-4 16th are classic examples, where missing the green in the wrong spot leads to nearly impossible up-and-downs.",
      "Playing No. 2 is a cerebral test of patience and shot-making, with the restored natural sandy landscape framing every hole. Its reputation was cemented by hosting more single-format championships than any American course, including three U.S. Opens. It is memorable for its walkable, rhythmic routing and the \"Pinehurst experience\" of chipping from firm sand onto elusive greens, a unique challenge that separates it from all other parkland courses."
    ],
    "architect": "Donald Ross",
    "established": 1907,
    "yardage": 7350,
    "continent": "North America",
    "latitude": 35.1954,
    "longitude": -79.4695,
    "isStudio": false,
    "hasStandardVersion": true,
    "studioFeatures": {
      "mappingType": "Lidar",
      "resolution": "True 4K Native",
      "physics": "Advanced Slope Engine",
      "accuracy": "Sub-Centimeter",
      "fileSize": "5 GB"
    },
    "standardFeatures": {
      "mappingType": "Satellite",
      "resolution": "HD (1080p)",
      "physics": "Standard Terrain Model",
      "accuracy": "1m",
      "fileSize": "500 MB"
    }
  },
  {
    "id": "royal-melbourne",
    "name": "Royal Melbourne Golf Club",
    "description": "Premier Australian sandbelt course",
    "location": "Melbourne, Australia",
    "rating": 4.6,
    "category": "recommended",
    "batch": "Absolute Icons & Major Venues",
    "type": "sandbelt",
    "blurb": [
      "The crown jewel of Australia's sandbelt region, the West Course is a 1931 collaboration between the brilliant architect Dr. Alister MacKenzie and local legend Alex Russell. It is characterized by its superb, sand-based terrain that drains perfectly, allowing for firm conditions year-round. The large, artfully contoured greens and strategic bunkering, like on the famous par-4 6th and the par-3 5th, demand careful positioning and creative approach play.",
      "The experience is one of strategic brilliance, where well-executed shots are rewarded with birdie chances, and errors are compounded. The fast, rolling greens are a particular test. It has hosted the Presidents Cup multiple times, showcasing its world-class quality to a global audience. Golfers remember Royal Melbourne for its impeccable conditioning, its clever design that challenges every club, and its status as the Southern Hemisphere's undisputed architectural masterpiece."
    ],
    "architect": "Alister MacKenzie",
    "yardage": 6900,
    "continent": "Oceania",
    "latitude": -37.8136,
    "longitude": 144.9631,
    "isStudio": false,
    "hasStandardVersion": true,
    "studioFeatures": {
      "mappingType": "Lidar",
      "resolution": "True 4K Native",
      "physics": "Advanced Slope Engine",
      "accuracy": "Sub-Centimeter",
      "fileSize": "5 GB"
    },
    "standardFeatures": {
      "mappingType": "Satellite",
      "resolution": "HD (1080p)",
      "physics": "Standard Terrain Model",
      "accuracy": "1m",
      "fileSize": "500 MB"
    }
  },
  {
    "id": "cypress-point",
    "name": "Cypress Point Club",
    "description": "Dramatic clifftop course on Monterey Peninsula",
    "location": "Pebble Beach, California",
    "rating": 4.9,
    "category": "recommended",
    "batch": "Premier Global Links & Sandbelt",
    "type": "coastal",
    "blurb": [
      "Alister MacKenzie's 1928 masterpiece on California's Monterey Peninsula is the most exclusive and beautifully routed of the iconic trio there. The course journeys from Del Monte forest to windswept dunes before reaching its breathtaking climax along the Pacific cliffs. The sequence from the par-3 15th over a chasm to the par-4 16th across an ocean cove is the most dramatic in golf, a sublime fusion of strategy and awe-inspiring scenery.",
      "The experience is intimate and strategic, with wide fairways and large greens that offer multiple playing angles, emphasizing shot placement over brute force. Its small membership and seclusion have kept it shrouded in mystery, though it famously hosted the AT&T Pebble Beach Pro-Am for decades. Golfers who play it remember it not for difficulty, but for its artistic perfection, peaceful walking, and the transcendent beauty of its ocean holes."
    ],
    "architect": "Alister MacKenzie",
    "yardage": 7300,
    "continent": "North America",
    "latitude": 36.5681,
    "longitude": -121.9494,
    "isStudio": true,
    "hasStandardVersion": true,
    "studioFeatures": {
      "mappingType": "Lidar",
      "resolution": "True 4K Native",
      "physics": "Advanced Slope Engine",
      "accuracy": "Sub-Centimeter",
      "fileSize": "5 GB"
    },
    "standardFeatures": {
      "mappingType": "Satellite",
      "resolution": "HD (1080p)",
      "physics": "Standard Terrain Model",
      "accuracy": "1m",
      "fileSize": "500 MB"
    }
  },
  {
    "id": "shinnecock-hills",
    "name": "Shinnecock Hills Golf Club",
    "description": "Historic links-style course in the Hamptons",
    "location": "Southampton, New York",
    "rating": 4.8,
    "category": "recent",
    "batch": "Premier Global Links & Sandbelt",
    "type": "links",
    "blurb": [
      "Established in 1891, Shinnecock in Southampton, New York, is considered the oldest golf club in America and the epitome of links-style design on this side of the Atlantic. Willie Davis, William Flynn, and later Howard Toomey shaped a course on rolling, wind-swept terrain with native fescue grasses. Its most iconic hole is the par-3 7th, with a deep, crowned green that rejects all but the most precise shot.",
      "The challenge is dictated by the wind and the cunningly contoured fairways and greens that demand strategic thought. It has hosted five U.S. Opens, with its firm, fast conditions famously confounding players in 2004 and 2018. Golfers remember Shinnecock for its timeless, understated beauty, its profound sense of history as a founding USGA club, and its presentation of a pure, wind-swept test that feels transplanted from Scotland."
    ],
    "architect": "William Flynn",
    "yardage": 6900,
    "continent": "North America",
    "latitude": 40.8843,
    "longitude": -72.3895,
    "isStudio": false,
    "hasStandardVersion": true,
    "studioFeatures": {
      "mappingType": "Lidar",
      "resolution": "True 4K Native",
      "physics": "Advanced Slope Engine",
      "accuracy": "Sub-Centimeter",
      "fileSize": "5 GB"
    },
    "standardFeatures": {
      "mappingType": "Satellite",
      "resolution": "HD (1080p)",
      "physics": "Standard Terrain Model",
      "accuracy": "1m",
      "fileSize": "500 MB"
    }
  },
  {
    "id": "oakmont",
    "name": "Oakmont Country Club",
    "description": "Challenging championship course with infamous bunkers",
    "location": "Oakmont, Pennsylvania",
    "rating": 4.7,
    "category": "recommended",
    "batch": "Absolute Icons & Major Venues",
    "type": "championship",
    "blurb": [
      "Founded in 1903 by industrialist Henry Fownes, Oakmont in Pennsylvania is a relentless, man-made test of golf defined by its infamous Church Pews bunker (between holes 3 and 4) and over 200 deep, furrowed sand traps. The course is famously fast, with slick, contoured poa annua greens and brutally long, narrow fairways. The par-4 10th and 12th holes are monumental challenges, demanding both length and precision.",
      "The experience is one of unyielding difficulty, where par is a stellar score. Oakmont's conditions are meticulously kept firm and lightning-quick, a tradition upheld by its membership. It has hosted a record nine U.S. Opens, witnessing historic moments like Johnny Miller's 63 and epic championships won by Hogan, Nicklaus, and Angel Cabrera. Golfers remember it for its austere, penal character and the pride of surviving one of the game's ultimate examinations."
    ],
    "architect": "Jack Nicklaus",
    "yardage": 7550,
    "continent": "North America",
    "latitude": 40.4367,
    "longitude": -79.8303,
    "isStudio": false,
    "hasStandardVersion": true,
    "studioFeatures": {
      "mappingType": "Lidar",
      "resolution": "True 4K Native",
      "physics": "Advanced Slope Engine",
      "accuracy": "Sub-Centimeter",
      "fileSize": "5 GB"
    },
    "standardFeatures": {
      "mappingType": "Satellite",
      "resolution": "HD (1080p)",
      "physics": "Standard Terrain Model",
      "accuracy": "1m",
      "fileSize": "500 MB"
    }
  },
  {
    "id": "bandon-dunes",
    "name": "Bandon Dunes Golf Resort",
    "description": "Links-style course on Oregon coast",
    "location": "Bandon, Oregon",
    "rating": 4.6,
    "category": "recent",
    "batch": "Premier Global Links & Sandbelt",
    "type": "links",
    "blurb": [
      "The course that started it all, David McLay Kidd's 1999 design proved a true links could thrive on the Oregon coast. It follows the natural contours of grassy bluffs high above the Pacific Ocean, with holes like the par-4 4th (\"Cannery\") and the par-4 16th (\"Bandon\") offering breathtaking ocean vistas. The design is rugged and natural, with wide fairways, gnarly fescue rough, and greens that blend seamlessly into the landscape.",
      "The play experience is defined by the omnipresent wind, the sound of crashing waves, and the joy of walking a pure, modern links. Its success single-handedly created America's premier golf destination. Golfers remember it for its unpretentious, \"golf as it was meant to be\" atmosphere, the stunning reveal of the ocean at the 4th hole, and the exhilarating, wind-swept challenge that feels both ancient and new."
    ],
    "yardage": 7000,
    "continent": "North America",
    "latitude": 43.1187,
    "longitude": -124.4085,
    "isStudio": false,
    "hasStandardVersion": true,
    "studioFeatures": {
      "mappingType": "Lidar",
      "resolution": "True 4K Native",
      "physics": "Advanced Slope Engine",
      "accuracy": "Sub-Centimeter",
      "fileSize": "5 GB"
    },
    "standardFeatures": {
      "mappingType": "Satellite",
      "resolution": "HD (1080p)",
      "physics": "Standard Terrain Model",
      "accuracy": "1m",
      "fileSize": "500 MB"
    }
  },
  {
    "id": "royal-county-down",
    "name": "Royal County Down",
    "description": "Spectacular links course in Northern Ireland",
    "location": "Newcastle, Northern Ireland",
    "rating": 4.8,
    "category": "recommended",
    "batch": "Absolute Icons & Major Venues",
    "type": "links",
    "blurb": [
      "Set against the dramatic backdrop of the Mountains of Mourne in Newcastle, Northern Ireland, this is perhaps the most visually stunning links in the world. Old Tom Morris and later Harry Shapland Colt shaped a course that winds through towering dunes covered in golden gorse and purple heather. Its signature holes, like the blind tee shot over a dune on the par-4 9th (\"The Hauld\") and the perilous approach to the 13th beside Dundrum Bay, are both beautiful and intimidating.",
      "The challenge is immense, with narrow, bending fairways, small greens, and thick rough punishing wayward shots. The ever-changing light and wind off the Irish Sea make no two rounds alike. Consistently ranked among the world's top three courses, its reputation is built on untouched natural beauty and a stern, traditional test. Golfers remember the sensory overload of its setting and the satisfaction of navigating its relentless, majestic holes."
    ],
    "architect": "Old Tom Morris",
    "yardage": 7300,
    "continent": "Europe",
    "latitude": 54.218,
    "longitude": -5.8898,
    "isStudio": false,
    "hasStandardVersion": true,
    "studioFeatures": {
      "mappingType": "Lidar",
      "resolution": "True 4K Native",
      "physics": "Advanced Slope Engine",
      "accuracy": "Sub-Centimeter",
      "fileSize": "5 GB"
    },
    "standardFeatures": {
      "mappingType": "Satellite",
      "resolution": "HD (1080p)",
      "physics": "Standard Terrain Model",
      "accuracy": "1m",
      "fileSize": "500 MB"
    }
  },
  {
    "id": "fishers-island",
    "name": "Fishers Island Club",
    "description": "Secluded island course with ocean views",
    "location": "Fishers Island, New York",
    "rating": 4.7,
    "category": "recommended",
    "batch": "Classic American Golden Age Designs",
    "type": "coastal",
    "blurb": [
      "Accessed only by ferry off the coast of Connecticut, Seth Raynor's 1926 design is a breathtakingly beautiful and strategic course on a narrow island. Raynor masterfully used the rocky, rolling terrain to create stunning template holes with ocean views from nearly every tee. The \"Biarritz\" 4th, with its deep swale cutting through the green, and the \"Redan\" 8th, played over a ridge, are perfectly sited against the backdrop of Long Island Sound.",
      "The experience is one of total seclusion and scenic grandeur, where the sound of the sea accompanies every shot. The wind is a constant factor on the exposed layout. While private and remote, it is consistently ranked among America's top courses for its flawless execution of Raynor's principles in an unforgettable setting. Golfers remember it as a peaceful, architectural pilgrimage to a perfect union of land, sea, and classic design."
    ],
    "yardage": 7450,
    "continent": "North America",
    "latitude": 41.2647,
    "longitude": -72.0294,
    "isStudio": false,
    "hasStandardVersion": true,
    "studioFeatures": {
      "mappingType": "Lidar",
      "resolution": "True 4K Native",
      "physics": "Advanced Slope Engine",
      "accuracy": "Sub-Centimeter",
      "fileSize": "5 GB"
    },
    "standardFeatures": {
      "mappingType": "Satellite",
      "resolution": "HD (1080p)",
      "physics": "Standard Terrain Model",
      "accuracy": "1m",
      "fileSize": "500 MB"
    }
  },
  {
    "id": "sand-hills",
    "name": "Sand Hills Golf Club",
    "description": "Natural links course in Nebraska sandhills",
    "location": "Mullen, Nebraska",
    "rating": 4.6,
    "category": "recent",
    "batch": "Classic American Golden Age Designs",
    "type": "parkland",
    "blurb": [
      "Bill Coore and Ben Crenshaw's 1995 design in the remote Nebraska sandhills is a modern masterpiece that appears untouched by man. The course was discovered, not built, routed through natural blowouts and dunes of fine, fescue-covered sand. Its character is defined by wide, natural fairways, firm and fast conditions, and greens that blend seamlessly into the landscape, like those on the par-4 9th and the epic par-5 18th.",
      "The play experience is the essence of minimalist, strategic golf, where players must choose their line and use the ground creatively. The complete solitude and connection to the vast prairie are profound. It revolutionized modern architecture by proving the value of finding great land over moving earth. Golfers remember it for its purity, the quality of its endless options, and the profound feeling of playing golf in its most natural state."
    ],
    "architect": "Ben Crenshaw",
    "yardage": 6850,
    "continent": "North America",
    "latitude": 41.9167,
    "longitude": -101.05,
    "isStudio": false,
    "hasStandardVersion": true,
    "studioFeatures": {
      "mappingType": "Lidar",
      "resolution": "True 4K Native",
      "physics": "Advanced Slope Engine",
      "accuracy": "Sub-Centimeter",
      "fileSize": "5 GB"
    },
    "standardFeatures": {
      "mappingType": "Satellite",
      "resolution": "HD (1080p)",
      "physics": "Standard Terrain Model",
      "accuracy": "1m",
      "fileSize": "500 MB"
    }
  },
  {
    "id": "royal-dornoch",
    "name": "Royal Dornoch Golf Club",
    "description": "Ancient Highland links course",
    "location": "Dornoch, Scotland",
    "rating": 4.5,
    "category": "recommended",
    "batch": "Absolute Icons & Major Venues",
    "type": "links",
    "blurb": [
      "Located north of Inverness in the Scottish Highlands, this ancient links (golf played here since 1616) is a serene and spiritual golfing experience. Laid out by Old Tom Morris and later refined by John H. Taylor and George Duncan, the course sits on a natural terrace above the Dornoch Firth. Its defining features are the massive, wickedly sloped greens that repel poorly struck approaches, most famously on the par-4 14th \"Foxy\" and the par-4 2nd.",
      "Play demands creativity, with players using mounds and slopes to feed the ball toward pins on the firm, fast fairways. The remote location ensures a peaceful round, often under the midnight sun. It is the hometown course of Donald Ross, who imported its principles to America. Golfers cherish Dornoch for its subtle genius, timeless ambiance, and the feeling of playing the game in its most natural, thoughtful form."
    ],
    "architect": "Donald Ross",
    "yardage": 6800,
    "continent": "Europe",
    "latitude": 57.88,
    "longitude": -4.0278,
    "isStudio": false,
    "hasStandardVersion": true,
    "studioFeatures": {
      "mappingType": "Lidar",
      "resolution": "True 4K Native",
      "physics": "Advanced Slope Engine",
      "accuracy": "Sub-Centimeter",
      "fileSize": "5 GB"
    },
    "standardFeatures": {
      "mappingType": "Satellite",
      "resolution": "HD (1080p)",
      "physics": "Standard Terrain Model",
      "accuracy": "1m",
      "fileSize": "500 MB"
    }
  },
  {
    "id": "kiawah-ocean",
    "name": "Kiawah Island Ocean Course",
    "description": "Windswept oceanfront links course",
    "location": "Kiawah Island, South Carolina",
    "rating": 4.4,
    "category": "recent",
    "batch": "Modern American Icons & Stadium Courses",
    "type": "coastal",
    "blurb": [
      "Pete Dye's 1991 design on the eastern tip of Kiawah Island, South Carolina, is the most exposed course in the Northern Hemisphere, with every hole offering a view of the Atlantic Ocean. Built for the 1991 Ryder Cup (\"The War by the Shore\"), the course was intentionally set along the dunes, with massive waste areas, firm paspalum turf, and wind that is a constant and dominant factor.",
      "The experience is defined by the wind's strength, which can change club selection by five clubs from one day to the next. The walking-only policy (with caddie) adds to the strenuous challenge. It hosted the epic 2012 PGA Championship, where Rory McIlroy won by a record margin, and the 2021 PGA, where Phil Mickelson made history. Golfers remember it for its unrelenting, windswept brutality, stunning seaside beauty, and the feeling of facing one of golf's ultimate endurance tests."
    ],
    "architect": "Pete Dye",
    "yardage": 7100,
    "continent": "North America",
    "latitude": 32.6083,
    "longitude": -80.0806,
    "isStudio": false,
    "hasStandardVersion": true,
    "studioFeatures": {
      "mappingType": "Lidar",
      "resolution": "True 4K Native",
      "physics": "Advanced Slope Engine",
      "accuracy": "Sub-Centimeter",
      "fileSize": "5 GB"
    },
    "standardFeatures": {
      "mappingType": "Satellite",
      "resolution": "HD (1080p)",
      "physics": "Standard Terrain Model",
      "accuracy": "1m",
      "fileSize": "500 MB"
    }
  },
  {
    "id": "pacific-dunes",
    "name": "Pacific Dunes",
    "description": "Dramatic dunes course at Bandon",
    "location": "Bandon, Oregon",
    "rating": 4.6,
    "category": "recommended",
    "batch": "Premier Global Links & Sandbelt",
    "type": "mountain",
    "blurb": [
      "Tom Doak's 2001 design immediately adjacent to the original course is often considered the more dramatic and natural of the two. The routing plunges through massive dunes closer to the ocean, creating intimate amphitheaters and thrilling carries. Signature moments include the par-4 4th along the beach, the short par-4 13th set in a dune dell, and the demanding par-3 17th over a chasm.",
      "Pacific Dunes offers a more varied and visually stunning journey, with constant elevation changes and unexpected vistas. The greens complexes are particularly imaginative, offering multiple routes for recovery. It is consistently ranked among the world's top public courses for its raw beauty and strategic options. Golfers remember its exhilarating, roller-coaster routing and the feeling of discovering a course that seems to have been shaped solely by nature."
    ],
    "yardage": 7350,
    "continent": "North America",
    "latitude": 43.1187,
    "longitude": -124.4085,
    "isStudio": false,
    "hasStandardVersion": true,
    "studioFeatures": {
      "mappingType": "Lidar",
      "resolution": "True 4K Native",
      "physics": "Advanced Slope Engine",
      "accuracy": "Sub-Centimeter",
      "fileSize": "5 GB"
    },
    "standardFeatures": {
      "mappingType": "Satellite",
      "resolution": "HD (1080p)",
      "physics": "Standard Terrain Model",
      "accuracy": "1m",
      "fileSize": "500 MB"
    }
  },
  {
    "id": "merion-east",
    "name": "Merion Golf Club (East)",
    "description": "Historic Philadelphia area championship course",
    "location": "Ardmore, Pennsylvania",
    "rating": 4.7,
    "category": "recommended",
    "batch": "Absolute Icons & Major Venues",
    "type": "championship",
    "blurb": [
      "Hugh Wilson's 1912 design on a compact property in Ardmore, Pennsylvania, is a masterpiece of strategic ingenuity. Famous for its wicker basket pins (instead of flags) and its brilliant use of the meandering Cobbs Creek, Merion packs immense challenge into its modest length. Its closing stretch is legendary, featuring the par-4 16th over Quarry Creek, the perilous par-3 17th, and the demanding uphill par-4 18th in front of the iconic stone clubhouse.",
      "The course demands intelligence over power, with precise placement required off every tee. Its thick rough and subtle green complexes punish careless play. Merion's history is profound, hosting five U.S. Opens, including Bobby Jones's 1930 Grand Slam completion and Justin Rose's 2013 victory. It is remembered for its classic, cerebral design that has consistently defied modern technology, proving a great course need not be long to be brutal."
    ],
    "architect": "Hugh Wilson",
    "yardage": 7600,
    "continent": "North America",
    "latitude": 40.0076,
    "longitude": -75.2852,
    "isStudio": false,
    "hasStandardVersion": true,
    "studioFeatures": {
      "mappingType": "Lidar",
      "resolution": "True 4K Native",
      "physics": "Advanced Slope Engine",
      "accuracy": "Sub-Centimeter",
      "fileSize": "5 GB"
    },
    "standardFeatures": {
      "mappingType": "Satellite",
      "resolution": "HD (1080p)",
      "physics": "Standard Terrain Model",
      "accuracy": "1m",
      "fileSize": "500 MB"
    }
  },
  {
    "id": "winged-foot-west",
    "name": "Winged Foot Golf Club (West)",
    "description": "Challenging A.W. Tillinghast design",
    "location": "Mamaroneck, New York",
    "rating": 4.6,
    "category": "recent",
    "batch": "Classic American Golden Age Designs",
    "type": "championship",
    "blurb": [
      "A.W. Tillinghast's 1923 masterpiece in Mamaroneck, New York, is the archetype of a tough, championship parkland test. Built on a former rocky quarry, its character is defined by narrow, tree-lined fairways, deep, punishing rough, and famously difficult, sloping greens. The closing holes are legendary for their difficulty, particularly the par-4 18th with its demanding approach to a green guarded by a deep bunker.",
      "The experience is one of unrelenting pressure, where par is an exceptional score on any hole. The conditions are kept firm and fast, true to its major championship heritage. It has hosted six U.S. Opens, including the \"Massacre at Winged Foot\" in 1974 and Phil Mickelson's dramatic collapse in 2006. Golfers remember it for its stern, uncompromising challenge, its classic presentation, and the palpable history in its clubhouse and on its treacherous greens."
    ],
    "architect": "A.W. Tillinghast",
    "yardage": 6800,
    "continent": "North America",
    "latitude": 40.9487,
    "longitude": -73.7326,
    "isStudio": false,
    "hasStandardVersion": true,
    "studioFeatures": {
      "mappingType": "Lidar",
      "resolution": "True 4K Native",
      "physics": "Advanced Slope Engine",
      "accuracy": "Sub-Centimeter",
      "fileSize": "5 GB"
    },
    "standardFeatures": {
      "mappingType": "Satellite",
      "resolution": "HD (1080p)",
      "physics": "Standard Terrain Model",
      "accuracy": "1m",
      "fileSize": "500 MB"
    }
  },
  {
    "id": "carnoustie",
    "name": "Carnoustie Golf Links",
    "description": "Tough Scottish links, venue of many Opens",
    "location": "Carnoustie, Scotland",
    "rating": 4.5,
    "category": "recommended",
    "batch": "Historic & Championship International Links",
    "type": "championship",
    "blurb": [
      "Often called \"Golf's Greatest Test,\" Carnoustie in Angus, Scotland, is a brutal, no-frills examination laid out by Allan Robertson and Old Tom Morris, with later modifications by James Braid. Its character is defined by narrow fairways, thick rough (the \"Carnoustie Carrots\"), and the infamous Barry Burn, which snakes across the closing holes. The finish—featuring the long par-3 16th, the perilous par-4 17th along the burn, and the daunting par-4 18th crossing the water twice—is the most demanding in championship golf.",
      "The experience is one of survival, where mental fortitude is as important as shot-making. Its reputation for difficulty was cemented by the 1999 Open, where Jean van de Velde's tragic collapse highlighted its penal nature. Host of eight Opens, with winners like Hogan ('53) and Player ('68), it is remembered for its uncompromising, almost grim challenge, rewarding only the most disciplined and courageous play under pressure."
    ],
    "architect": "Donald Ross",
    "yardage": 6900,
    "continent": "Europe",
    "latitude": 56.5,
    "longitude": -2.7,
    "isStudio": false,
    "hasStandardVersion": true,
    "studioFeatures": {
      "mappingType": "Lidar",
      "resolution": "True 4K Native",
      "physics": "Advanced Slope Engine",
      "accuracy": "Sub-Centimeter",
      "fileSize": "5 GB"
    },
    "standardFeatures": {
      "mappingType": "Satellite",
      "resolution": "HD (1080p)",
      "physics": "Standard Terrain Model",
      "accuracy": "1m",
      "fileSize": "500 MB"
    }
  },
  {
    "id": "bethpage-black",
    "name": "Bethpage State Park (Black)",
    "description": "Public course that hosts major championships",
    "location": "Farmingdale, New York",
    "rating": 4.4,
    "category": "recent",
    "batch": null,
    "type": "championship",
    "yardage": 7300,
    "continent": "North America",
    "latitude": 40.7326,
    "longitude": -73.4454,
    "isStudio": false,
    "hasStandardVersion": true,
    "studioFeatures": {
      "mappingType": "Lidar",
      "resolution": "True 4K Native",
      "physics": "Advanced Slope Engine",
      "accuracy": "Sub-Centimeter",
      "fileSize": "5 GB"
    },
    "standardFeatures": {
      "mappingType": "Satellite",
      "resolution": "HD (1080p)",
      "physics": "Standard Terrain Model",
      "accuracy": "1m",
      "fileSize": "500 MB"
    }
  },
  {
    "id": "royal-troon",
    "name": "Royal Troon Golf Club",
    "description": "Classic Scottish links with famous Postage Stamp hole",
    "location": "Troon, Scotland",
    "rating": 4.6,
    "category": "recommended",
    "batch": "Absolute Icons & Major Venues",
    "type": "links",
    "blurb": [
      "This classic Scottish links on the Ayrshire coast is a tale of two nines, with the outward half playing downwind and the inward half battling the prevailing westerlies. Its most famous feature is the par-3 8th, \"The Postage Stamp,\" a mere 123-yard hole with a tiny green surrounded by deep bunkers. The back nine is a formidable challenge, culminating in the long par-4 18th played back to the iconic clubhouse.",
      "The experience is defined by mastering the wind and avoiding Troon's treacherous pot bunkers. The course conditions are fast and firm, typical of a true links. It has hosted The Open nine times, producing dramatic moments from Gene Sarazen's victory to Henrik Stenson's duel with Phil Mickelson in 2016. It is memorable for its quintessential links character, its blend of short, cunning holes and long, demanding ones, and the iconic challenge of the Postage Stamp."
    ],
    "yardage": 7100,
    "continent": "Europe",
    "latitude": 55.5417,
    "longitude": -4.6583,
    "isStudio": false,
    "hasStandardVersion": true,
    "studioFeatures": {
      "mappingType": "Lidar",
      "resolution": "True 4K Native",
      "physics": "Advanced Slope Engine",
      "accuracy": "Sub-Centimeter",
      "fileSize": "5 GB"
    },
    "standardFeatures": {
      "mappingType": "Satellite",
      "resolution": "HD (1080p)",
      "physics": "Standard Terrain Model",
      "accuracy": "1m",
      "fileSize": "500 MB"
    }
  },
  {
    "id": "crystal-downs",
    "name": "Crystal Downs Country Club",
    "description": "Alister MacKenzie design overlooking Lake Michigan",
    "location": "Frankfort, Michigan",
    "rating": 4.5,
    "category": "recommended",
    "batch": "Classic American Golden Age Designs",
    "type": "links",
    "blurb": [
      "Nestled on sleeping sand dunes overlooking Lake Michigan near Frankfort, this 1931 collaboration between Alister MacKenzie and Perry Maxwell is a hidden gem of genius routing. The course flows over dramatic, natural landforms with blind shots, wildly undulating fairways, and incredibly contoured greens that are Maxwell's signature. The par-4 7th, plunging downhill to a treacherous green, and the par-5 12th are standout examples of strategic, exhilarating golf.",
      "Playing Crystal Downs is a unique adventure requiring local knowledge, creativity, and a love for quirky, natural architecture. Its secluded location and firm, fescue conditions make it feel like a inland links. Rarely seen in championships, its reputation is legendary among architecture enthusiasts. Golfers cherish it for its playful spirit, breathtaking natural beauty, and the feeling of discovering one of the world's most original and fun courses."
    ],
    "architect": "Alister MacKenzie",
    "yardage": 7600,
    "continent": "North America",
    "latitude": 44.6336,
    "longitude": -86.2342
  },
  {
    "id": "national-golf-links",
    "name": "National Golf Links of America",
    "description": "Historic course inspired by British links",
    "location": "Southampton, New York",
    "rating": 4.7,
    "category": "recent",
    "batch": "Premier Global Links & Sandbelt",
    "type": "links",
    "blurb": [
      "Charles Blair Macdonald, inspired by his studies of the great British holes, built this 1911 course in Southampton as a manifesto for strategic American golf. It is a \"template\" course, featuring inspired adaptations like the \"Redan\" par-3 4th, the \"Alps\" 3rd, and the \"Eden\" 17th. The routing offers panoramic views of Peconic Bay and seamlessly blends the templates into the natural, rolling Long Island terrain.",
      "Playing NGLA is a historical and strategic education, where angles and ground game are paramount. It is a walking-only club dedicated to the spirit of the game. While it has never hosted a major, its influence is immeasurable as the model for strategic architecture in the U.S. Golfers remember it for its intellectual charm, its celebration of golf's heritage, and the sheer joy of experiencing Macdonald's revolutionary concepts firsthand."
    ],
    "yardage": 7150,
    "continent": "North America",
    "latitude": 40.8843,
    "longitude": -72.3895
  },
  {
    "id": "royal-birkdale",
    "name": "Royal Birkdale Golf Club",
    "description": "Championship links course on England's coast",
    "location": "Southport, England",
    "rating": 4.6,
    "category": "recommended",
    "batch": "Historic & Championship International Links",
    "type": "links",
    "blurb": [
      "Situated in the seaside town of Southport, England, Royal Birkdale is renowned for its classic, consistent linksland defined by large, imposing sand dunes that run perpendicular to the coast. The holes play in the valleys between these dunes, creating natural amphitheaters and often blind tee shots. Its signature is the elegant, art deco-style clubhouse and the demanding par-4 18th, framed by the dunes and grandstands.",
      "The course is considered one of the fairest Open venues, with clear lines of play from the tee and fewer blind shots than other links. Its challenge comes from the wind and its deep, revetted pot bunkers. Having hosted ten Opens, with champions like Palmer, Watson, and Price, it is famous for producing worthy winners. Golfers remember Birkdale for its logical, straightforward test, superb conditioning, and its history of dramatic major moments."
    ],
    "yardage": 7350,
    "continent": "Europe",
    "latitude": 53.6474,
    "longitude": -3.0061
  },
  {
    "id": "maidstone-club",
    "name": "Maidstone Club",
    "description": "Links-style course in the Hamptons",
    "location": "East Hampton, New York",
    "rating": 4.4,
    "category": "recent",
    "batch": null,
    "type": "links",
    "yardage": 7450,
    "continent": "North America",
    "latitude": 40.9634,
    "longitude": -72.1848
  },
  {
    "id": "prairie-dunes",
    "name": "Prairie Dunes Country Club",
    "description": "Links-style course on Kansas prairie",
    "location": "Hutchinson, Kansas",
    "rating": 4.3,
    "category": "recommended",
    "batch": "Strategic & Artistic Gems",
    "type": "links",
    "blurb": [
      "A true miracle in the Kansas prairie, this Perry Maxwell design (opened 1937, expanded 1957) is a windswept, links-like treasure. Built on sandy soil perfect for golf, the course curls through huge, natural dunes covered in tall native grasses, yucca plants, and wildflowers. Its character is defined by its \"Maxwell Rolls\"—subtle, rippling landforms in the fairways and around the greens that create unpredictable bounces and stances. The par-4 5th and the par-3 17th are world-class examples of natural design.",
      "Playing Prairie Dunes is a pure, walking-only experience where the wind is the primary defense and creativity is essential. It feels like a Scottish links magically transported to the American heartland. It has hosted multiple USGA championships, including the 2002 U.S. Women's Open, proving its championship mettle. Golfers remember it for its unexpected, breathtaking beauty, its firm and fast conditions, and its status as one of the game's greatest natural finds."
    ],
    "architect": "Perry Maxwell",
    "established": 1937,
    "yardage": 7100,
    "continent": "North America",
    "latitude": 38.0608,
    "longitude": -97.9298
  },
  {
    "id": "royal-portrush",
    "name": "Royal Portrush Golf Club",
    "description": "Dramatic Northern Irish links course",
    "location": "Portrush, Northern Ireland",
    "rating": 4.5,
    "category": "recommended",
    "batch": "Absolute Icons & Major Venues",
    "type": "links",
    "blurb": [
      "Set on the dramatic dunes of Northern Ireland's Antrim coast, this Harry Colt design is one of the world's most spectacular links. The front nine ventures into rugged, interior dunes, while the back nine delivers breathtaking ocean views, most famously at the par-3 \"Calamity\" 14th, a 200-yard carry over a deep chasm. The course was brilliantly revised by Martin Ebert to host The Open, adding two new holes (7 and 8) in the giant \"Himalayas\" dunes.",
      "Playing Portrush is a thrilling journey through varied, majestic terrain. The wind and undulating fairways demand constant adjustment. Its history was made when it hosted the first Open outside Scotland or England in 1951, and again in 2019 when Shane Lowry's victory confirmed its world-class status. Golfers remember it for its stunning beauty, exhilarating holes, and the warm, welcoming atmosphere of a true championship venue."
    ],
    "architect": "Harry Colt",
    "yardage": 7100,
    "continent": "Europe",
    "latitude": 55.2,
    "longitude": -6.65
  },
  {
    "id": "somerset-hills",
    "name": "Somerset Hills Country Club",
    "description": "A.W. Tillinghast masterpiece in New Jersey",
    "location": "Bernardsville, New Jersey",
    "rating": 4.2,
    "category": "recent",
    "batch": "Classic American Golden Age Designs",
    "type": "championship",
    "blurb": [
      "A.W. Tillinghast's 1918 design in Bernardsville, New Jersey, is a beautifully rolling parkland course celebrated for its artistic bunkering and brilliant green complexes. Set on a former country estate, the routing takes full advantage of valleys, ridges, and a central pond. The par-3 7th over water to a two-tiered green and the dramatic, downhill par-4 18th to a clubhouse-setting green are particularly memorable holes.",
      "The experience is one of variety and charm, with each hole offering a distinct and beautiful challenge. The conditions are always pristine, emphasizing the course's strategic beauty. While less known for hosting majors, it is a titan among classic club courses. Golfers remember Somerset Hills for its peaceful, elegant atmosphere, its walkable and fun design, and as a quintessential example of Tillinghast's more playful, artistic side."
    ],
    "architect": "A.W. Tillinghast",
    "yardage": 7500,
    "continent": "North America",
    "latitude": 40.7182,
    "longitude": -74.5693
  },
  {
    "id": "muirfield",
    "name": "Muirfield",
    "description": "Private Scottish links, venue of many Opens",
    "location": "Gullane, Scotland",
    "rating": 4.7,
    "category": "recommended",
    "batch": "Absolute Icons & Major Venues",
    "type": "links",
    "blurb": [
      "The home of The Honourable Company of Edinburgh Golfers (founded 1744), Muirfield in Gullane, Scotland, presents a unique and revered links layout. Its design, by Old Tom Morris and later Harry Colt, features two concentric loops of nine holes (clockwise then anti-clockwise), ensuring the wind is challenged from every direction. The course is defined by its firm, fast fairways, punishing rough, and beautifully bunkered greens that demand strategic positioning.",
      "Play at Muirfield is a stern but fair examination, prized for rewarding well-thought-out shots. The conditions are consistently superb, maintained to championship standards. It has hosted 16 Open Championships, with a champions roll including Nicklaus, Player, Trevino, and Faldo. Golfers remember it for its solemn, traditional atmosphere, its logical and brilliant routing, and its status as perhaps the most complete and balanced test of links golf in the world."
    ],
    "architect": "Jack Nicklaus",
    "yardage": 7400,
    "continent": "Europe",
    "latitude": 56.0333,
    "longitude": -2.8333
  },
  {
    "id": "whistling-straits",
    "name": "Whistling Straits",
    "description": "Lakefront course designed to look like Irish links",
    "location": "Kohler, Wisconsin",
    "rating": 4.3,
    "category": "recent",
    "batch": "Modern American Icons & Stadium Courses",
    "type": "links",
    "blurb": [
      "Pete Dye's 1998 creation on the bluffs of Lake Michigan in Kohler, Wisconsin, is a manufactured masterpiece designed to mimic the rugged links of Ireland. With over 1,000 bunkers (many just for show), fescue-covered dunes, and constant vistas of the vast lake, the course is defined by its visual intimidation. The closing stretch along the water, particularly the par-3 17th and the demanding par-4 18th, provides a dramatic finish worthy of its major championship status.",
      "The experience is walking-only with a caddie, enhancing the links-like feel. The challenge is severe, with windy conditions, uneven lies, and penal rough. It has hosted three PGA Championships and the 2021 Ryder Cup, where its stadium-style layout created thrilling spectator moments. Golfers remember it for its breathtaking scale and scenery, the sheer difficulty of its setup, and the surreal achievement of bringing coastal drama to the American Midwest."
    ],
    "architect": "Pete Dye",
    "yardage": 7350,
    "continent": "North America",
    "latitude": 43.7389,
    "longitude": -87.7817
  },
  {
    "id": "baltusrol-lower",
    "name": "Baltusrol Golf Club (Lower)",
    "description": "Historic New Jersey championship course",
    "location": "Springfield, New Jersey",
    "rating": 4.4,
    "category": "recommended",
    "batch": null,
    "type": "championship",
    "yardage": 7050,
    "continent": "North America",
    "latitude": 40.7045,
    "longitude": -74.3171
  },
  {
    "id": "chicago-golf",
    "name": "Chicago Golf Club",
    "description": "Historic club with classic American design",
    "location": "Wheaton, Illinois",
    "rating": 4.3,
    "category": "recent",
    "batch": "Classic American Golden Age Designs",
    "type": "championship",
    "blurb": [
      "Founded in 1892, Chicago Golf is one of the five original USGA charter clubs and features a classic, understated Seth Raynor redesign from 1923. Located in the flat plains of Wheaton, Illinois, Raynor created interest through strategic bunkering, subtle mounding, and superb template holes like the \"Road\" 2nd, the \"Short\" 9th, and the \"Biarritz\" 15th. The course is defined by its crisp, traditional presentation and strategic demands.",
      "Playing here is a walk through architectural history on impeccably maintained, fast-running turf. Its challenge is subtle but relentless, based on angles and position rather than length. It has hosted multiple early U.S. Opens and Walker Cups, preserving a bygone era of the game. Golfers remember it for its deep sense of tradition, its strategic, walkable routing, and its status as a perfectly preserved museum of Raynor's design ideals."
    ],
    "yardage": 6850,
    "continent": "North America",
    "latitude": 41.8661,
    "longitude": -88.107
  },
  {
    "id": "royal-lytham",
    "name": "Royal Lytham & St. Annes",
    "description": "Links course famous for its challenging finish",
    "location": "Lytham St. Annes, England",
    "rating": 4.4,
    "category": "recommended",
    "batch": "Historic & Championship International Links",
    "type": "links",
    "blurb": [
      "An unusual and demanding links set slightly inland from the Irish Sea in Lancashire, England. Its character is defined by over 200 bunkers—many lurking unseen from the tee—and a closing stretch played back towards the red-brick clubhouse past railway tracks. The opener is a rare par 3, and the finish, particularly the long par-4 17th with its famous fairway bunker, has decided many championships.",
      "The challenge at Lytham is strategic and cerebral, requiring precise driving to avoid its penal hazards. The absence of ocean views adds to its claustrophobic, intense feel. It has hosted 11 Opens, with iconic wins by Bobby Jones (1926) and Seve Ballesteros (1979 & 1988). Golfers remember it for its unique, bunker-dominated character, its history of crowning shot-making geniuses, and its tough, unglamorous, and utterly compelling test."
    ],
    "yardage": 6600,
    "continent": "Europe",
    "latitude": 53.7425,
    "longitude": -3.0069
  },
  {
    "id": "ridgewood",
    "name": "Ridgewood Country Club",
    "description": "Classic A.W. Tillinghast design in New Jersey",
    "location": "Ridgewood, New Jersey",
    "rating": 4.1,
    "category": "recent",
    "batch": null,
    "type": "parkland",
    "architect": "A.W. Tillinghast",
    "yardage": 6950,
    "continent": "North America",
    "latitude": 40.9793,
    "longitude": -74.1165
  },
  {
    "id": "turnberry",
    "name": "Trump Turnberry",
    "description": "Scenic Scottish links on Ayrshire coast",
    "location": "Turnberry, Scotland",
    "rating": 4.5,
    "category": "recommended",
    "batch": "Historic & Championship International Links",
    "type": "coastal",
    "blurb": [
      "Dramatically situated on the Ayrshire coast with views to the iconic lighthouse and Isle of Arran, the Ailsa is Scotland's most scenic Open venue. Originally by Willie Fernie, it was transformed by Mackenzie Ross after WWII and recently redesigned by Martin Ebert. The new routing brings the famous par-3 9th and par-4 10th to the cliff's edge, creating a breathtaking stretch alongside the Firth of Clyde.",
      "The experience is one of spectacular beauty and strategic challenge, where wind dictates scoring. Its history is defined by the 1977 \"Duel in the Sun\" between Watson and Nicklaus, arguably the greatest Open ever played. While currently outside The Open rota, its quality is undeniable. Golfers remember Turnberry for its unparalleled vistas, its heroic, risk-reward holes, and the romantic atmosphere of its seaside setting."
    ],
    "architect": "Alister MacKenzie",
    "yardage": 7250,
    "continent": "Europe",
    "latitude": 55.3167,
    "longitude": -4.8333
  },
  {
    "id": "los-angeles-north",
    "name": "Los Angeles Country Club (North)",
    "description": "Historic course in Beverly Hills",
    "location": "Los Angeles, California",
    "rating": 4.6,
    "category": "recent",
    "batch": null,
    "type": "parkland",
    "yardage": 7050,
    "continent": "North America",
    "latitude": 34.0522,
    "longitude": -118.2437
  },
  {
    "id": "garden-city",
    "name": "Garden City Golf Club",
    "description": "Classic Walter Travis design on Long Island",
    "location": "Garden City, New York",
    "rating": 4.2,
    "category": "recommended",
    "batch": "Classic American Golden Age Designs",
    "type": "parkland",
    "architect": "Walter Travis",
    "yardage": 6750,
    "continent": "North America",
    "latitude": 40.7268,
    "longitude": -73.6343
  },
  {
    "id": "royal-st-georges",
    "name": "Royal St. George's Golf Club",
    "description": "Historic English links course",
    "location": "Sandwich, England",
    "rating": 4.3,
    "category": "recommended",
    "batch": "Historic & Championship International Links",
    "type": "links",
    "blurb": [
      "Located in Sandwich, Kent, this is the quintessential classic English links, featuring rumpled, quirky fairways and some of the most severe undulations in golf. Its character is defined by the \"Himalaya\" bunker on the 4th hole, the giant dunes, and blind shots like the drive on the par-4 6th. The course is an authentic, unpredictable test where good shots can sometimes find bad places.",
      "Playing here requires local knowledge, patience, and an ability to handle awkward stances and bounces. It has hosted 15 Opens, the first in England (1894), and produced dramatic winners like Greg Norman (1993) and Darren Clarke (2011). Golfers remember Royal St. George's for its old-school charm, its refusal to be \"tamed,\" and the sense that one is playing the game exactly as it was contested over a century ago."
    ],
    "yardage": 6850,
    "continent": "Europe",
    "latitude": 51.2787,
    "longitude": 1.3385
  },
  {
    "id": "congressional",
    "name": "Congressional Country Club",
    "description": "Championship course near Washington DC",
    "location": "Bethesda, Maryland",
    "rating": 4.2,
    "category": "recent",
    "batch": null,
    "type": "championship",
    "yardage": 6850,
    "continent": "North America",
    "latitude": 38.9847,
    "longitude": -77.0947
  },
  {
    "id": "riviera",
    "name": "Riviera Country Club",
    "description": "Classic Los Angeles course, home of Genesis Invitational",
    "location": "Pacific Palisades, California",
    "rating": 4.4,
    "category": "recent",
    "batch": null,
    "type": "parkland",
    "yardage": 6850,
    "continent": "North America",
    "latitude": 34.0475,
    "longitude": -118.5265
  },
  {
    "id": "seminole",
    "name": "Seminole Golf Club",
    "description": "Donald Ross design in Florida",
    "location": "Juno Beach, Florida",
    "rating": 4.3,
    "category": "recommended",
    "batch": null,
    "type": "parkland",
    "architect": "Donald Ross",
    "yardage": 7100,
    "continent": "North America",
    "latitude": 26.8798,
    "longitude": -80.0534
  },
  {
    "id": "yeamans-hall",
    "name": "Yeamans Hall Club",
    "description": "Historic Charleston area course",
    "location": "Hanahan, South Carolina",
    "rating": 4.1,
    "category": "recent",
    "batch": "Strategic & Artistic Gems",
    "type": "parkland",
    "blurb": [
      "This 1925 Seth Raynor design near Charleston, South Carolina, is a timeless, low-country classic built on the site of an old rice and cotton plantation. The course is wonderfully flat, with strategic interest derived from Raynor's signature geometric bunkering, canals, and large, often-tilted greens. It features superb template holes, including a \"Road Hole\" (the 6th), a \"Biarritz\" (the 8th), and a \"Short\" (the 13th), all framed by ancient live oaks and magnolias.",
      "The experience is one of serene, understated elegance and strategic thought, where angles and position are paramount. The sandy soil provides excellent drainage, leading to firm conditions year-round. A walking-only club with a deep sense of tradition, it is a favorite among architecture purists. Golfers remember Yeamans Hall for its peaceful, unhurried ambiance, its perfect Raynor design principles, and its preservation of a golden-age aesthetic."
    ],
    "yardage": 7000,
    "continent": "North America",
    "latitude": 32.9185,
    "longitude": -80.022
  },
  {
    "id": "bay-hill",
    "name": "Bay Hill Club & Lodge",
    "description": "Arnold Palmer's home course in Orlando",
    "location": "Orlando, Florida",
    "rating": 4.0,
    "category": "recommended",
    "batch": "Destination & Scenic Resort Courses",
    "type": "parkland",
    "yardage": 6750,
    "continent": "North America",
    "latitude": 28.5383,
    "longitude": -81.3792
  },
  {
    "id": "hazeltine",
    "name": "Hazeltine National Golf Club",
    "description": "Championship course in Minnesota",
    "location": "Chaska, Minnesota",
    "rating": 4.1,
    "category": "recent",
    "batch": "Premier Global Links & Sandbelt",
    "type": "championship",
    "yardage": 6950,
    "continent": "North America",
    "latitude": 44.7894,
    "longitude": -93.6022
  },
  {
    "id": "san-francisco-golf",
    "name": "San Francisco Golf Club",
    "description": "A.W. Tillinghast design overlooking Pacific",
    "location": "San Francisco, California",
    "rating": 4.2,
    "category": "recommended",
    "batch": null,
    "type": "coastal",
    "architect": "A.W. Tillinghast",
    "yardage": 6500,
    "continent": "North America",
    "latitude": 37.7749,
    "longitude": -122.4194
  },
  {
    "id": "garden-city-gc",
    "name": "Garden City Golf Club",
    "description": "Historic New York course",
    "location": "Garden City, New York",
    "rating": 4.0,
    "category": "recent",
    "batch": "Classic American Golden Age Designs",
    "type": "links",
    "blurb": [
      "This historic Long Island club, founded in 1899, features a supremely strategic and subtle design by Walter J. Travis (with later input by Devereux Emmet). Built on sandy, rolling terrain, it is famous for its small, fiercely defended greens, treacherous cross-bunkers, and thick, native rough. The par-4 opening hole and the long, demanding par-4 10th are classic examples of its cerebral, positional challenge.",
      "Playing Garden City demands precision, patience, and superb course management over power. The wind is often a factor on its open, links-like property. It has a storied amateur history, hosting multiple Walker Cups and U.S. Amateurs. Golfers remember it for its old-world, traditional character, its incredibly clever design that rewards intelligence, and the sense of competing on a course that has tested the game's greatest amateurs for over a century."
    ],
    "architect": "Donald Ross",
    "yardage": 7100,
    "continent": "North America",
    "latitude": 40.7268,
    "longitude": -73.6343
  },
  {
    "id": "olympic-lake",
    "name": "Olympic Club (Lake Course)",
    "description": "Challenging San Francisco championship venue",
    "location": "San Francisco, California",
    "rating": 4.3,
    "category": "recommended",
    "batch": null,
    "type": "championship",
    "yardage": 7550,
    "continent": "North America",
    "latitude": 37.7749,
    "longitude": -122.4194
  },
  {
    "id": "quaker-ridge",
    "name": "Quaker Ridge Golf Club",
    "description": "A.W. Tillinghast design in New York",
    "location": "Scarsdale, New York",
    "rating": 4.2,
    "category": "recent",
    "batch": null,
    "type": "parkland",
    "architect": "A.W. Tillinghast",
    "yardage": 7050,
    "continent": "North America",
    "latitude": 41.0051,
    "longitude": -73.7846
  },
  {
    "id": "shoreacres",
    "name": "Shoreacres Golf Club",
    "description": "Seth Raynor design on Lake Michigan",
    "location": "Lake Bluff, Illinois",
    "rating": 4.1,
    "category": "recommended",
    "batch": "Strategic & Artistic Gems",
    "type": "mountain",
    "blurb": [
      "Tucked along the bluffs of Lake Michigan north of Chicago, this 1916 Seth Raynor design is a compact, beautifully routed masterpiece. Raynor expertly used the dramatic, ravined property to create thrilling, strategic holes with significant elevation changes. The standout sequence includes the par-4 6th, which plunges into a valley, and the par-3 7th, with a green perched high above the lake. The course is a masterclass in maximizing a challenging site.",
      "Playing Shoreacres is a walk through architectural genius, with varied holes that demand every club and shot shape. The small membership and secluded setting make it a hidden gem. It is consistently ranked among America's top 100 courses for its incredible design and conditioning. Golfers remember it for its dramatic terrain, its brilliant use of the ravines, and the feeling of discovering one of Raynor's most complete and exhilarating works."
    ],
    "yardage": 7300,
    "continent": "North America",
    "latitude": 42.2792,
    "longitude": -87.8348
  },
  {
    "id": "eastward-ho",
    "name": "Eastward Ho Country Club",
    "description": "Cape Cod links-style course",
    "location": "Chatham, Massachusetts",
    "rating": 4.0,
    "category": "recent",
    "batch": "Strategic & Artistic Gems",
    "type": "links",
    "blurb": [
      "Situated on the windswept coast of Cape Cod in Chatham, Massachusetts, this 1922 Herbert Fowler design (with later input by William S. Flynn) is a quintessential New England links. The course plays over rolling, sandy terrain with panoramic views of Pleasant Bay and the Atlantic. It features large, undulating greens, strategic bunkering, and native rough of bayberry and beach plum. The seaside holes, like the par-3 8th, are particularly memorable.",
      "The experience is defined by the salt air, constant wind, and firm, fast-running turf that rewards the ground game. It is a walking-only club that values tradition and the spirit of the game. While relatively short by modern standards, its strategic demands and ever-changing conditions provide a timeless challenge. Golfers remember Eastward Ho! for its rugged, natural beauty, its relaxed and friendly atmosphere, and its authentic, unpretentious links feel far from Scotland."
    ],
    "architect": "William Flynn",
    "yardage": 7300,
    "continent": "North America",
    "latitude": 41.6812,
    "longitude": -69.9597
  },
  {
    "id": "royal-aberdeen",
    "name": "Royal Aberdeen Golf Club",
    "description": "Historic Scottish links course",
    "location": "Aberdeen, Scotland",
    "rating": 4.3,
    "category": "recommended",
    "batch": "Absolute Icons & Major Venues",
    "type": "links",
    "blurb": [
      "Founded in 1780, the sixth-oldest club in the world, its Balgownie Links is a classic, out-and-back routing. The acclaimed front nine runs tightly along the North Sea coast through towering dunes, considered one of the finest stretches in golf. The back nine turns inland on flatter, more heathland-like terrain, providing a contrasting but solid test, with the par-4 18th finishing in the clubhouse's shadow.",
      "Playing here is a lesson in links history and a pure test of controlling the ball in the wind, especially on the thrilling outward half. It has hosted the Senior Open and the 2014 Scottish Open, introducing its qualities to a wider audience. Golfers remember Royal Aberdeen for its majestic, traditional front nine, its deep sense of history, and the feeling of playing a championship-caliber course that remains authentic and unpretentious."
    ],
    "yardage": 7000,
    "continent": "Europe",
    "latitude": 57.1497,
    "longitude": -2.0943
  },
  {
    "id": "kingsbarns",
    "name": "Kingsbarns Golf Links",
    "description": "Modern links course in Scotland",
    "location": "St. Andrews, Scotland",
    "rating": 4.2,
    "category": "recent",
    "batch": "Historic & Championship International Links",
    "type": "links",
    "blurb": [
      "A modern masterpiece (opened 2000) by Kyle Phillips just down the coast from St. Andrews, Kingsbarns proves a true links can be created. Every hole offers a view of the sea, with six playing directly along the shore. The design uses natural ridges and valleys, with standout holes like the par-5 12th, where the fairway curls along the beach, and the risk-reward par-4 15th over a rocky cove.",
      "The play experience is exhilarating and accessible, with wide fairways and playable ground, though wind and clever bunkering provide ample challenge. It co-hosts the annual Alfred Dunhill Links Championship alongside the Old Course. Golfers remember Kingsbarns for its stunning beauty from start to finish, its impeccable conditioning, and its success in feeling both timeless and modern, offering a \"perfect day out\" on the links."
    ],
    "established": 2000,
    "yardage": 6600,
    "continent": "Europe",
    "latitude": 56.3398,
    "longitude": -2.7967
  },
  {
    "id": "castle-pines",
    "name": "Castle Pines Golf Club",
    "description": "High-altitude course in Colorado",
    "location": "Castle Rock, Colorado",
    "rating": 4.0,
    "category": "recommended",
    "batch": "Desert & Mountain Classics",
    "type": "mountain",
    "blurb": [
      "Set at 6,500 feet in the Rocky Mountain foothills near Denver, Jack Nicklaus's 1981 design was a pioneering high-altitude championship venue. The course winds through stands of ponderosa pine, across dramatic canyons, and over natural rock formations. Its signature is the spectacular par-3 16th, played from an elevated tee over a deep gorge to a green backed by Cathedral Spires rock formations.",
      "The experience is defined by thin air, dramatic elevation changes, and fast, undulating bent grass greens. It hosted The International, a unique PGA Tour event using the modified Stableford scoring system, for over 20 years. Golfers remember Castle Pines for its breathtaking mountain scenery, the strategic and demanding Nicklaus design, and its legacy as an exclusive club that successfully brought top-tier professional golf to the Colorado mountains."
    ],
    "architect": "Donald Ross",
    "yardage": 7200,
    "continent": "North America",
    "latitude": 39.3722,
    "longitude": -104.8561
  },
  {
    "id": "casa-de-campo",
    "name": "Casa de Campo (Teeth of the Dog)",
    "description": "Pete Dye design in Dominican Republic",
    "location": "La Romana, Dominican Republic",
    "rating": 4.4,
    "category": "recent",
    "batch": "Destination & Scenic Resort Courses",
    "type": "coastal",
    "blurb": [
      "Pete Dye's 1971 design in the Dominican Republic is his personal favorite, famous for having seven holes carved directly into the coral cliffs above the Caribbean Sea. Using local \"chiri\" labor and hand-cut coral rock, Dye created a masterpiece where the ocean is an in-play hazard. The par-3 5th, 6th, and 7th holes along the \"Dog's Teeth\" coral formations are among the most photographed in the world.",
      "The experience is a blend of tropical beauty and strategic Pete Dye hallmarks: railroad ties, small pot bunkers, and tricky green complexes. The inland holes are strong in their own right, playing through palm groves and water. Golfers remember Teeth of the Dog for its thrilling, intimate interaction with the ocean, its rustic charm, and the joy of playing a true architectural landmark in a vibrant, resort setting."
    ],
    "architect": "Pete Dye",
    "yardage": 6550,
    "continent": "Middle East",
    "latitude": 18.4273,
    "longitude": -68.9728
  },
  {
    "id": "half-moon-bay",
    "name": "Half Moon Bay Golf Links",
    "description": "Oceanfront course south of San Francisco",
    "location": "Half Moon Bay, California",
    "rating": 3.9,
    "category": "recommended",
    "batch": "Destination & Scenic Resort Courses",
    "type": "links",
    "blurb": [
      "Set on the dramatic cliffs just south of San Francisco, the Ocean Course at Half Moon Bay is a Arthur Hills design that provides a windswept, links-like experience. The front nine plays through coastal marshes and lakes, while the back nine delivers a stunning finish along the Pacific Ocean bluffs. The closing par-3 17th and par-5 18th, with the ocean on the left and the historic Ritz-Carlton hotel framing the green, are unforgettable.",
      "The play experience is defined by the cool, often strong coastal winds and the spectacular public-access scenery. It's a popular course for both locals and visitors seeking a taste of Pebble Beach drama at a more accessible price point. Golfers remember it for its fantastic cliffside finishing holes, the cozy post-round atmosphere at the oceanfront restaurant, and the chance to play a rugged, scenic round just a short drive from the city."
    ],
    "yardage": 7250,
    "continent": "North America",
    "latitude": 37.4636,
    "longitude": -122.4286
  },
  {
    "id": "chambers-bay",
    "name": "Chambers Bay Golf Course",
    "description": "Links-style course on Puget Sound",
    "location": "University Place, Washington",
    "rating": 4.1,
    "category": "recent",
    "batch": "Destination & Scenic Resort Courses",
    "type": "links",
    "yardage": 6950,
    "continent": "North America",
    "latitude": 47.2357,
    "longitude": -122.5504
  },
  {
    "id": "whistling-straits-irish",
    "name": "Whistling Straits (Irish Course)",
    "description": "Sister course to the Straits Course",
    "location": "Kohler, Wisconsin",
    "rating": 4.0,
    "category": "recommended",
    "batch": "Modern American Icons & Stadium Courses",
    "type": "parkland",
    "yardage": 6950,
    "continent": "North America",
    "latitude": 43.7389,
    "longitude": -87.7817
  },
  {
    "id": "streamsong-red",
    "name": "Streamsong Resort (Red Course)",
    "description": "Modern course in Florida phosphate mine",
    "location": "Bowling Green, Florida",
    "rating": 4.2,
    "category": "recent",
    "batch": "Modern American Icons & Stadium Courses",
    "type": "sandbelt",
    "blurb": [
      "Coore & Crenshaw's 2012 design, built on a reclaimed Florida phosphate mine, is part of a revolutionary golf destination. The Red Course is characterized by dramatic, rust-colored sand dunes, expansive waste areas, and massive, undulating greens. Its most famous hole is the par-3 16th, with a deep, bowl-shaped green that collects shots and offers creative recovery options.",
      "Playing the Red is a walking-only experience through a surreal, minimalist landscape that feels like a blend of Sand Hills and the Australian sandbelt. The wind and strategic options define the challenge, not rough or water. It is consistently ranked among America's top modern courses. Golfers remember it for its otherworldly beauty, the superb quality of its firm fescue turf, and its genius routing that feels both natural and ingeniously crafted."
    ],
    "architect": "Ben Crenshaw",
    "yardage": 7350,
    "continent": "North America",
    "latitude": 30.628,
    "longitude": -86.7144
  },
  {
    "id": "streamsong-blue",
    "name": "Streamsong Resort (Blue Course)",
    "description": "Tom Doak design at Streamsong",
    "location": "Bowling Green, Florida",
    "rating": 4.1,
    "category": "recommended",
    "batch": "Modern American Icons & Stadium Courses",
    "type": "mountain",
    "blurb": [
      "Tom Doak's 2012 counterpart to the Red Course offers a different interpretation of the same dramatic terrain. The Blue Course features more dramatic elevation changes, with holes like the par-3 7th played from an elevated tee to a green far below, and the punchbowl green at the par-4 17th. The overall feel is more rugged and intimate, with greens that are often more severely contoured.",
      "The experience highlights walking and strategy, with caddies highly recommended to navigate the blind shots and complex greens. It is often praised for its fun and playability, with more risk-reward opportunities than the Red. Golfers remember the Blue for its bold, dramatic vistas, its exceptionally fun and imaginative green complexes, and the distinct personality it shows compared to its sibling, proving the architects' unique visions on shared land."
    ],
    "yardage": 6950,
    "continent": "North America",
    "latitude": 30.628,
    "longitude": -86.7144
  },
  {
    "id": "trump-doral",
    "name": "Trump National Doral",
    "description": "Blue Monster course in Miami",
    "location": "Miami, Florida",
    "rating": 3.8,
    "category": "recent",
    "batch": "Premier Global Links & Sandbelt",
    "type": "parkland",
    "yardage": 6850,
    "continent": "North America",
    "latitude": 25.7617,
    "longitude": -80.1918
  },
  {
    "id": "torrey-pines-south",
    "name": "Torrey Pines Golf Course (South)",
    "description": "Clifftop course overlooking Pacific Ocean",
    "location": "La Jolla, California",
    "rating": 4.0,
    "category": "recommended",
    "batch": "Desert & Mountain Classics",
    "type": "coastal",
    "yardage": 7400,
    "continent": "North America",
    "latitude": 32.8328,
    "longitude": -117.2713
  },
  {
    "id": "spyglass-hill",
    "name": "Spyglass Hill Golf Course",
    "description": "Robert Trent Jones design on Monterey Peninsula",
    "location": "Pebble Beach, California",
    "rating": 4.2,
    "category": "recent",
    "batch": null,
    "type": "parkland",
    "architect": "Robert Trent Jones",
    "yardage": 6800,
    "continent": "North America",
    "latitude": 36.5681,
    "longitude": -121.9494
  },
  {
    "id": "french-lick",
    "name": "French Lick Resort (Pete Dye Course)",
    "description": "Championship course in Indiana",
    "location": "French Lick, Indiana",
    "rating": 3.9,
    "category": "recommended",
    "batch": "Desert & Mountain Classics",
    "type": "championship",
    "blurb": [
      "Pete Dye's 2009 design in the rolling hills of southern Indiana is a monumental and difficult public course. Built on a dramatic, sweeping ridgetop, it features vast, exposed landscapes with deep fescue rough, massive bunkers, and enormous, wildly contoured greens. The most talked-about feature is its length—it can stretch to over 8,100 yards from the tips, making it one of the world's longest courses.",
      "The play experience is a grueling, windswept test of endurance and skill, with breathtaking views stretching for miles. While intimidating, multiple tees make it playable for all. It has hosted the PGA Professional Championship and Senior PGA Championship. Golfers remember it for its sheer scale, the feeling of playing a championship test on top of the world, and Dye's unabashed commitment to creating a modern, punishing masterpiece."
    ],
    "architect": "Pete Dye",
    "yardage": 7600,
    "continent": "North America",
    "latitude": 38.5489,
    "longitude": -86.62
  },
  {
    "id": "bandon-trails",
    "name": "Bandon Trails",
    "description": "Forest course at Bandon Dunes Resort",
    "location": "Bandon, Oregon",
    "rating": 4.1,
    "category": "recent",
    "batch": "Premier Global Links & Sandbelt",
    "type": "links",
    "blurb": [
      "A bold departure from the coastal links, Coore & Crenshaw's 2005 design ventures inland through serene pine forest, dense gorse, and finally opens to dramatic meadows. This three-act routing provides a stunning change of scenery and showcases the property's diverse ecosystems. Highlights include the cliffside par-3 6th, the strategic par-4 12th in the meadows, and the finishing hole framed by bunkers and forest.",
      "The experience offers a respite from ocean winds, focusing more on precise shot-making and strategy through tree-lined corridors. It demonstrates that world-class golf at Bandon isn't solely about ocean views. Golfers remember Bandon Trails for its brilliant, thoughtful design, its peaceful and varied environment, and its proof that the resort's magic extends beyond the immediate coastline."
    ],
    "architect": "Ben Crenshaw",
    "yardage": 7150,
    "continent": "North America",
    "latitude": 43.1187,
    "longitude": -124.4085
  },
  {
    "id": "old-macdonald",
    "name": "Old Macdonald",
    "description": "Template course at Bandon Dunes",
    "location": "Bandon, Oregon",
    "rating": 4.0,
    "category": "recommended",
    "batch": null,
    "type": "parkland",
    "blurb": [
      "A tribute to the architectural principles of C.B. Macdonald and his protégé Seth Raynor, Tom Doak and Jim Urbina's 2010 course is a vast, expansive layout featuring large-scale template holes. With enormous double greens, deep bunkers, and wide fairways, it channels the spirit of early American golf. Standout templates include the \"Road Hole\" 3rd, the \"Short\" 5th, and the epic \"Double Plateau\" green at the 13th.",
      "Playing Old Mac is a bold, ground-game adventure where putting from 50 yards off the green is often the smart play. The scale is grand, and the wind is a dominant factor on the more exposed terrain. It is memorable as a living museum of golf architecture, offering a fun, strategic, and massively scaled experience that celebrates the game's strategic origins in a pure, walking-only environment."
    ],
    "yardage": 6950,
    "continent": "North America",
    "latitude": 43.1187,
    "longitude": -124.4085
  },
  {
    "id": "harbour-town",
    "name": "Harbour Town Golf Links",
    "description": "Pete Dye design famous for RBC Heritage",
    "location": "Hilton Head, South Carolina",
    "rating": 4.1,
    "category": "recent",
    "batch": "Destination & Scenic Resort Courses",
    "type": "parkland",
    "blurb": [
      "A collaboration between Pete Dye and consulting architect Jack Nicklaus in 1969, Harbour Town on Hilton Head Island is a strategic, shot-maker's course distinct from most modern designs. Its character is defined by narrow, tree-lined fairways, small, firm greens, and over 100 cunningly placed bunkers. The finishing hole, the par-4 18th, played along the Calibogue Sound to the iconic red-and-white striped lighthouse, is one of golf's most recognizable.",
      "The experience emphasizes precision over power, with position off the tee being paramount. It has hosted the RBC Heritage on the PGA Tour every year since 1969, where its plaid jacket trophy is a beloved tradition. Golfers remember Harbour Town for its intelligent, classic design that still challenges today's players, its charming Lowcountry setting under ancient live oaks, and the historic, postcard-perfect lighthouse finish."
    ],
    "architect": "Pete Dye",
    "established": 1969,
    "yardage": 6650,
    "continent": "North America",
    "latitude": 32.2163,
    "longitude": -80.7526
  },
  {
    "id": "tpc-sawgrass",
    "name": "TPC Sawgrass (Stadium Course)",
    "description": "Home of THE PLAYERS Championship",
    "location": "Ponte Vedra Beach, Florida",
    "rating": 4.0,
    "category": "recommended",
    "batch": "Modern American Icons & Stadium Courses",
    "type": "championship",
    "blurb": [
      "Pete Dye's 1980 design in Ponte Vedra Beach, Florida, was revolutionary as the first true \"Stadium Course,\" built specifically to host THE PLAYERS Championship and enhance spectator viewing. Its character is defined by small, well-guarded greens, water hazards on 17 of 18 holes, and the infamous island green on the par-3 17th—a 137-yard shot that creates unparalleled pressure.",
      "Playing Sawgrass is a nerve-wracking exercise in target golf, demanding precision over power. The course conditions are kept tour-perfect year-round. As the permanent home of the PGA Tour's flagship event since 1982, it has witnessed golf's most dramatic moments, from \"Better Than Most\" putts to Sunday collapses on the 17th. Golfers remember it for the unique, palpable pressure of the island green and the fair but demanding test that perfectly identifies the game's best ball-strikers."
    ],
    "architect": "Pete Dye",
    "established": 1982,
    "yardage": 7350,
    "continent": "North America",
    "latitude": 30.2394,
    "longitude": -81.3856
  },
  {
    "id": "shadow-creek",
    "name": "Shadow Creek Golf Course",
    "description": "Tom Fazio design in Las Vegas desert",
    "location": "North Las Vegas, Nevada",
    "rating": 4.3,
    "category": "recent",
    "batch": "Modern American Icons & Stadium Courses",
    "type": "desert",
    "blurb": [
      "Tom Fazio's 1989 creation in the Nevada desert is a testament to unlimited resources and imagination. Built for casino owner Steve Wynn, the course was a $60 million project that transformed flat, barren desert into a stunning, lush oasis with towering pines, flowing streams, and man-made mountains. The routing feels secluded and exclusive, with each hole isolated in its own theatrical setting.",
      "The experience is one of surreal luxury, including mandatory forecaddies and limousine transport from the Strip. The conditions are immaculate, rivaling any private club. While originally ultra-exclusive, it is now a premium public-access course affiliated with MGM Resorts. Golfers remember Shadow Creek not for its difficulty (though it is a solid test), but for its jaw-dropping artificial beauty and the feeling of playing in a private, billion-dollar fantasyland."
    ],
    "architect": "Tom Fazio",
    "yardage": 7300,
    "continent": "North America",
    "latitude": 36.1989,
    "longitude": -115.1175
  },
  {
    "id": "cascata",
    "name": "Cascata Golf Club",
    "description": "Dramatic desert course near Las Vegas",
    "location": "Boulder City, Nevada",
    "rating": 4.0,
    "category": "recommended",
    "batch": "Desert & Mountain Classics",
    "type": "desert",
    "blurb": [
      "A Rees Jones design carved into the rugged foothills of the Black Mountains near Las Vegas, Cascata (2000) is an opulent and dramatic desert oasis. The name means \"waterfall\" in Italian, and a 418-foot waterfall flows through the red-rock canyon, inside the clubhouse, and alongside several holes. The course winds through isolated canyons, with each hole feeling private and surrounded by towering stone walls.",
      "The experience is one of exclusive luxury, with a no-tee-times, ultra-private-club level of service for its public players. The challenge is significant, with elevation changes, strategic bunkering, and water in play. While expensive, it is considered the premier high-end public golf experience in Las Vegas. Golfers remember Cascata for its breathtaking artificial beauty, the novelty of the interior waterfall, and the feeling of playing in a secluded, high-desert fortress."
    ],
    "yardage": 6550,
    "continent": "North America",
    "latitude": 35.9786,
    "longitude": -114.8325
  },
  {
    "id": "wolf-creek",
    "name": "Wolf Creek Golf Club",
    "description": "Spectacular desert course in Nevada",
    "location": "Mesquite, Nevada",
    "rating": 3.9,
    "category": "recent",
    "batch": "Desert & Mountain Classics",
    "type": "desert",
    "blurb": [
      "Located in the desert canyonlands of Mesquite, Nevada, Wolf Creek (2000) is a visually stunning and extreme golf experience. Designer Dennis Rider used the natural, multi-colored sandstone cliffs and deep ravines to create a course of dramatic plunges and climbs. Holes like the par-5 6th, which drops over 200 feet from tee to fairway, and the island-green par-3 15th feel more like a fantasy video game than a traditional round.",
      "Playing Wolf Creek is an exhilarating ride, with cart paths carved into canyon walls and shots over vast chasms. It is more about spectacle and enjoyment than a pure strategic test. The conditions are immaculately maintained against the rugged desert backdrop. Golfers remember it for its unforgettable, almost surreal visuals, the thrill of its elevation changes, and the pure fun of playing a course that feels like an adventure park for golfers."
    ],
    "yardage": 7050,
    "continent": "North America",
    "latitude": 36.8055,
    "longitude": -114.0672
  },
  {
    "id": "kapalua-plantation",
    "name": "Kapalua Resort (Plantation Course)",
    "description": "Maui course hosting Tournament of Champions",
    "location": "Lahaina, Hawaii",
    "rating": 4.2,
    "category": "recommended",
    "batch": "Destination & Scenic Resort Courses",
    "type": "links",
    "blurb": [
      "Co-designed by Ben Crenshaw and Bill Coore in 1991, the Plantation Course sprawls across the lush, rolling slopes of West Maui. Built on a former pineapple plantation, its character is defined by dramatic elevation changes, massive, wide fairways, and greens that encourage the ground game. The most famous hole is the par-5 18th, a dramatic 663-yard downhill plunge with a panoramic Pacific Ocean backdrop that plays much shorter than its yardage.",
      "The experience is one of breathtaking vistas and fun, resort-friendly golf where the trade winds are a constant factor. It hosts the PGA Tour's Sentry Tournament of Champions each January, where its generous width allows the world's best to attack aggressively. Golfers remember it for its spectacular scenery, the unique thrill of its downhill holes, and the relaxed, \"big\" feeling of playing a course designed for both enjoyment and professional drama."
    ],
    "architect": "Donald Ross",
    "yardage": 6750,
    "continent": "North America",
    "latitude": 20.8783,
    "longitude": -156.6825
  },
  {
    "id": "mauna-kea",
    "name": "Mauna Kea Golf Course",
    "description": "Robert Trent Jones design on Big Island",
    "location": "Kamuela, Hawaii",
    "rating": 4.1,
    "category": "recent",
    "batch": "Destination & Scenic Resort Courses",
    "type": "coastal",
    "blurb": [
      "Robert Trent Jones Sr.'s 1964 masterpiece on the Big Island's Kohala Coast was the course that first put Hawaiian golf on the world map. Its defining moment is the iconic, breathtaking par-3 3rd hole, requiring a forced carry entirely over a black lava inlet of the Pacific Ocean. The course artfully threads through rugged, ancient lava fields, with contoured fairways and large greens providing strategic interest amidst the stark, beautiful landscape.",
      "Playing Mauna Kea is a journey through geological history, with stark black lava contrasting against emerald fairways and the deep blue sea. The conditions are pristine, and the wind can be a formidable challenge. While modernized by Trent Jones Jr., it retains its classic, strategic character. Golfers remember it for the sheer drama of the ocean-carry 3rd hole, its timeless design, and its status as the original luxury golf experience in Hawaii."
    ],
    "architect": "Robert Trent Jones",
    "yardage": 7000,
    "continent": "North America",
    "latitude": 20.02,
    "longitude": -155.6694
  },
  {
    "id": "princeville",
    "name": "Princeville Resort (Makai Course)",
    "description": "Clifftop course on Kauai",
    "location": "Princeville, Hawaii",
    "rating": 4.0,
    "category": "recommended",
    "batch": "Destination & Scenic Resort Courses",
    "type": "mountain",
    "blurb": [
      "Originally designed by Robert Trent Jones Jr. in 1971 on the north shore of Kauai, the Makai Course was stunningly renovated in 2010. The course is celebrated for its breathtaking clifftop holes overlooking the Pacific Ocean and the mountains of Hanalei Bay. The most famous stretch is the \"Ocean Nine,\" particularly the par-3 7th, which plays from a cliff edge to a green perched above the surf.",
      "Playing the Makai is an immersive experience in tropical beauty, with lush landscaping, ocean vistas, and challenging trade winds. The course offers multiple sets of tees, making it enjoyable for all skill levels while maintaining strategic interest for better players. Golfers remember it for its spectacular, movie-set scenery, the thrill of the oceanfront holes, and its superb conditioning as the centerpiece of a luxurious resort."
    ],
    "architect": "Robert Trent Jones",
    "yardage": 7350,
    "continent": "North America",
    "latitude": 22.2167,
    "longitude": -159.4833
  },
  {
    "id": "wailea-gold",
    "name": "Wailea Golf Club (Gold Course)",
    "description": "Robert Trent Jones Jr. design in Maui",
    "location": "Wailea, Hawaii",
    "rating": 3.9,
    "category": "recent",
    "batch": "Destination & Scenic Resort Courses",
    "type": "links",
    "blurb": [
      "Robert Trent Jones Jr.'s 1994 design on the sunny, dry southern slopes of Maui is a resort course built on ancient lava flows. The Gold Course is known for its expansive, links-style feel, with wide, forgiving fairways, large greens, and 90 strategically placed bunkers. The panoramic views are constant, taking in the ocean, the neighboring islands of Kahoolawe and Molokini, and the towering Haleakala volcano.",
      "The experience is one of enjoyable, playable golf in perfect weather, with the challenge coming from the wind and the thoughtful bunkering rather than penal rough. It frequently hosts professional senior events. Golfers remember the Gold Course for its fantastic resort conditions, its wonderful pace of play, and the fact that it provides a serious yet fun test with some of the most reliable and beautiful views in all of Hawaiian golf."
    ],
    "architect": "Robert Trent Jones",
    "yardage": 7500,
    "continent": "North America",
    "latitude": 20.69,
    "longitude": -156.44
  },
  {
    "id": "pga-west-stadium",
    "name": "PGA West (Stadium Course)",
    "description": "Pete Dye design with famous island green",
    "location": "La Quinta, California",
    "rating": 4.0,
    "category": "recommended",
    "batch": null,
    "type": "parkland",
    "architect": "Pete Dye",
    "yardage": 6800,
    "continent": "North America",
    "latitude": 33.6634,
    "longitude": -116.31
  },
  {
    "id": "indian-wells",
    "name": "Indian Wells Golf Resort",
    "description": "Desert course in California's Coachella Valley",
    "location": "Indian Wells, California",
    "rating": 3.8,
    "category": "recent",
    "batch": "Modern American Icons & Stadium Courses",
    "type": "desert",
    "yardage": 6800,
    "continent": "North America",
    "latitude": 33.7175,
    "longitude": -116.34
  },
  {
    "id": "desert-highlands",
    "name": "Desert Highlands Golf Club",
    "description": "Jack Nicklaus design in Scottsdale",
    "location": "Scottsdale, Arizona",
    "rating": 3.9,
    "category": "recommended",
    "batch": null,
    "type": "parkland",
    "architect": "Jack Nicklaus",
    "yardage": 6450,
    "continent": "North America",
    "latitude": 33.4942,
    "longitude": -111.9261
  },
  {
    "id": "troon-north",
    "name": "Troon North Golf Club",
    "description": "Desert course in Scottsdale foothills",
    "location": "Scottsdale, Arizona",
    "rating": 4.0,
    "category": "recent",
    "batch": "Absolute Icons & Major Venues",
    "type": "desert",
    "blurb": [
      "Carved through the massive granite boulders and foothills of the Sonoran Desert in Scottsdale, the Monument Course by Tom Weiskopf and Jay Morrish (1990) is the defining image of upscale desert golf. Its character is shaped by rugged, natural washes, immense saguaro cacti, and greens framed by dramatic rock outcroppings. The par-4 3rd hole, bending around a hillside of boulders, and the risk-reward par-5 8th are standout examples of desert target golf.",
      "The experience combines pristine, lush playing conditions with the raw beauty of the untouched desert. Accuracy is paramount, as errant shots are lost to the \"desert floor\" rocky waste areas. Consistently ranked as Arizona's top public course, it is famous for its impeccable maintenance and scenic grandeur. Golfers remember it for its perfect blend of challenge and beauty, creating a round that feels both luxurious and authentically of the desert."
    ],
    "architect": "Tom Weiskopf",
    "yardage": 6500,
    "continent": "North America",
    "latitude": 33.4942,
    "longitude": -111.9261
  },
  {
    "id": "we-ko-pa",
    "name": "We-Ko-Pa Golf Club",
    "description": "Native American owned course in Arizona",
    "location": "Scottsdale, Arizona",
    "rating": 3.9,
    "category": "recommended",
    "batch": "Desert & Mountain Classics",
    "type": "desert",
    "blurb": [
      "A 2006 collaboration by Bill Coore and Ben Crenshaw, the Saguaro Course is a walking-only, strategic masterpiece set on pure, undisturbed desert land owned by the Fort McDowell Yavapai Nation. Unlike typical desert target golf, its design features wide, interconnected fairways that encourage ground play and multiple angles of attack. The course follows the natural contours of the land, with minimal earth moved and stunning views of the surrounding mountain ranges.",
      "Playing Saguaro is a pure, fun, and thoughtful experience that emphasizes strategy over forced carries. The native desert grasses and bunkering blend seamlessly. It is consistently praised as one of America's best public courses for its minimalist philosophy and pure golf focus. Golfers remember it for its walkable, engaging routing, its respect for the natural desert, and the refreshing feel of a course where creativity is rewarded more than mere power."
    ],
    "architect": "Ben Crenshaw",
    "yardage": 6550,
    "continent": "North America",
    "latitude": 33.4942,
    "longitude": -111.9261
  },
  {
    "id": "four-seasons-scottsdale",
    "name": "Four Seasons Resort Scottsdale",
    "description": "Desert course with mountain views",
    "location": "Scottsdale, Arizona",
    "rating": 3.8,
    "category": "recent",
    "batch": null,
    "type": "desert",
    "yardage": 7350,
    "continent": "North America",
    "latitude": 33.4942,
    "longitude": -111.9261
  },
  {
    "id": "tobacco-road",
    "name": "Tobacco Road Golf Club",
    "description": "Mike Strantz design in North Carolina",
    "location": "Sanford, North Carolina",
    "rating": 4.0,
    "category": "recommended",
    "batch": "Strategic & Artistic Gems",
    "type": "mountain",
    "blurb": [
      "The late Mike Strantz's 1998 design in Sanford, North Carolina, is a polarizing and unforgettable work of art. Built on a reclaimed sand quarry, the course is a wild, visual rollercoaster with massive elevation changes, blind shots, huge waste areas, and dramatically contoured fairways and greens. The par-4 13th, requiring a tee shot over a vast sandy waste to a hidden fairway, exemplifies its thrilling, risk-reward philosophy.",
      "Playing Tobacco Road is an adventure that demands trust in the architect and a willingness to embrace the unconventional. It is not a traditional strategic test but an exhilarating sensory experience. Golfers either love or hate its in-your-face style, but no one forgets it. They remember it for its bold, theatrical design, its fun and playability for those who follow the cues, and its status as one of the most original courses built in the last 50 years."
    ],
    "yardage": 7300,
    "continent": "North America",
    "latitude": 35.4799,
    "longitude": -79.1803
  },
  {
    "id": "true-blue",
    "name": "True Blue Golf Club",
    "description": "Mike Strantz design in Myrtle Beach",
    "location": "Pawleys Island, South Carolina",
    "rating": 3.9,
    "category": "recent",
    "batch": "Strategic & Artistic Gems",
    "type": "parkland",
    "blurb": [
      "Another Mike Strantz masterpiece (1998) in Pawleys Island, South Carolina, True Blue offers a different but equally dramatic experience. Built on the site of a historic indigo and rice plantation, the course features expansive, naturally sandy waste areas, huge, undulating fairways, and large, dramatic bunkers. The par-4 4th, with its waste area splitting the fairway, and the stunning par-3 12th over water are signature examples of Strantz's genius for scale and visual impact.",
      "The experience is one of expansive, generous landing areas that lead to complex, demanding approach shots. The conditions are typically excellent, with fast Bermuda grass greens. While less blind and extreme than Tobacco Road, it is every bit as fun and memorable. Golfers remember True Blue for its spectacular Lowcountry setting, its \"big\" feel, and the sheer enjoyment of playing a course that is both beautiful and strategically engaging from every tee."
    ],
    "yardage": 6800,
    "continent": "North America",
    "latitude": 33.4352,
    "longitude": -79.1278
  },
  {
    "id": "caledonia",
    "name": "Caledonia Golf & Fish Club",
    "description": "Historic rice plantation course",
    "location": "Pawleys Island, South Carolina",
    "rating": 4.0,
    "category": "recommended",
    "batch": "Strategic & Artistic Gems",
    "type": "parkland",
    "blurb": [
      "Mike Strantz's first solo design (1994) in Pawleys Island is built on the site of a historic rice plantation and is often considered his most aesthetically beautiful work. The course blends stunning Lowcountry scenery—ancient live oaks, marshes, and ponds—with creative, strategic golf. The par-4 18th, requiring an approach over water to a green framed by the iconic white clubhouse, is one of the most photographed finishing holes in the game.",
      "Playing Caledonia is a scenic and enjoyable experience that is more refined and less dramatic than Strantz's later work. The emphasis is on shot-making and course management rather than sheer spectacle. It is consistently ranked as one of the top public courses in the Myrtle Beach area. Golfers remember it for its breathtaking beauty, its fantastic conditioning, and the perfect harmony Strantz achieved between the game and its gorgeous natural setting."
    ],
    "yardage": 7200,
    "continent": "North America",
    "latitude": 33.4352,
    "longitude": -79.1278
  },
  {
    "id": "dunes-golf-beach",
    "name": "The Dunes Golf & Beach Club",
    "description": "Robert Trent Jones design in Myrtle Beach",
    "location": "Myrtle Beach, South Carolina",
    "rating": 3.8,
    "category": "recent",
    "batch": "Strategic & Artistic Gems",
    "type": "resort",
    "blurb": [
      "A 1948 Robert Trent Jones Sr. design in Myrtle Beach, South Carolina, \"The Granddaddy\" helped establish the region as a golf destination. It is a classic, tree-lined layout that winds through maritime forest and features Jones's signature strategic elements: large, well-bunkered greens, forced carries over water, and risk-reward options. The par-5 13th, \"Waterloo,\" with its green surrounded on three sides by Lake Singleton, is its most famous challenge.",
      "The experience blends traditional, strategic design with the fun of a classic American golf resort. It has hosted the PGA Tour and numerous prestigious amateur events, maintaining its reputation over decades. Golfers remember The Dunes Club for its timeless, quality design that still holds up today, its rich history in Myrtle Beach, and the enjoyable, straightforward test it provides amidst a sea of more modern competitors."
    ],
    "architect": "Robert Trent Jones",
    "yardage": 7100,
    "continent": "North America",
    "latitude": 33.6891,
    "longitude": -78.8867
  },
  {
    "id": "tidewater",
    "name": "Tidewater Golf Club",
    "description": "Marsh course in Myrtle Beach area",
    "location": "North Myrtle Beach, South Carolina",
    "rating": 3.9,
    "category": "recommended",
    "batch": null,
    "type": "parkland",
    "yardage": 6450,
    "continent": "North America",
    "latitude": 33.816,
    "longitude": -78.68
  },
  {
    "id": "eagle-point",
    "name": "Eagle Point Golf Club",
    "description": "Tom Fazio design in Wilmington",
    "location": "Wilmington, North Carolina",
    "rating": 3.8,
    "category": "recent",
    "batch": "Premier Global Links & Sandbelt",
    "type": "parkland",
    "architect": "Tom Fazio",
    "yardage": 7150,
    "continent": "North America",
    "latitude": 34.2257,
    "longitude": -77.9447
  },
  {
    "id": "forest-dunes",
    "name": "Forest Dunes Golf Club",
    "description": "Tom Weiskopf design in Michigan",
    "location": "Roscommon, Michigan",
    "rating": 4.0,
    "category": "recommended",
    "batch": "Strategic & Artistic Gems",
    "type": "links",
    "blurb": [
      "Tom Doak's 2016 reversible course in Roscommon, Michigan, is a revolutionary concept in modern golf. The same 18 green complexes are used for two distinct 18-hole routings—the \"Black\" course (played clockwise) and the \"Red\" course (counter-clockwise). Built on super-sandy soil, it's a firm, fast, fescue-covered links with wide fairways, large greens, and strategic bunkering that comes into play differently depending on the direction of play.",
      "The experience is a fascinating study in architecture, as playing both loops in one day reveals how design choices change strategy and perspective. It is a walking-only course that emphasizes fun, strategy, and the pure enjoyment of the game. Golfers remember The Loop for its incredible ingenuity, its superb conditioning, and the unique thrill of playing what feels like two excellent, yet completely different, courses on the same piece of land."
    ],
    "architect": "Tom Weiskopf",
    "yardage": 7400,
    "continent": "North America",
    "latitude": 42.3314,
    "longitude": -83.0458
  },
  {
    "id": "arcadia-bluffs",
    "name": "Arcadia Bluffs Golf Club",
    "description": "Links-style course overlooking Lake Michigan",
    "location": "Arcadia, Michigan",
    "rating": 4.1,
    "category": "recent",
    "batch": "Desert & Mountain Classics",
    "type": "links",
    "blurb": [
      "Perched 180 feet above Lake Michigan near the town of Arcadia, this Rick Smith/Warren Henderson design (1999) offers a spectacular, links-style experience on the lake's eastern shore. The course rolls over massive, man-made dunes covered in tall fescue, with 14 holes providing direct views of the water. The par-4 12th and par-3 13th along the cliffs are particularly dramatic, rivaling the vistas of Pebble Beach.",
      "The experience is defined by constant wind, firm and fast conditions, and strategic play along the ground. Its walking-only policy (with caddies encouraged) enhances the authentic links feel. As a top-ranked public course, it is a Midwest pilgrimage site. Golfers remember Arcadia Bluffs for its stunning, panoramic lake views, its challenging and fun design, and the incredible sunset rounds that make it one of golf's most scenic public plays."
    ],
    "yardage": 7150,
    "continent": "North America",
    "latitude": 42.3314,
    "longitude": -83.0458
  },
  {
    "id": "bay-harbor",
    "name": "Bay Harbor Golf Club",
    "description": "Arthur Hills design on Lake Michigan",
    "location": "Bay Harbor, Michigan",
    "rating": 3.9,
    "category": "recommended",
    "batch": "Destination & Scenic Resort Courses",
    "type": "parkland",
    "yardage": 7350,
    "continent": "North America",
    "latitude": 42.3314,
    "longitude": -83.0458
  },
  {
    "id": "kohler-blackwolf",
    "name": "Blackwolf Run Golf Club",
    "description": "Pete Dye design in Wisconsin",
    "location": "Kohler, Wisconsin",
    "rating": 4.0,
    "category": "recent",
    "batch": null,
    "type": "parkland",
    "architect": "Pete Dye",
    "yardage": 7050,
    "continent": "North America",
    "latitude": 43.7389,
    "longitude": -87.7817
  },
  {
    "id": "erin-hills",
    "name": "Erin Hills Golf Course",
    "description": "Links-style course that hosted US Open",
    "location": "Erin, Wisconsin",
    "rating": 4.1,
    "category": "recommended",
    "batch": "Modern American Icons & Stadium Courses",
    "type": "links",
    "blurb": [
      "Carved from glacial kettle moraine in rural Wisconsin, this 2006 design by Michael Hurdzan, Dana Fry, and Ron Whitten is a massive, walking-only, links-style public course. Its character is defined by wide, fescue-covered fairways that sweep through natural ridges and valleys, expansive sand blowouts, and large, subtly contoured greens. The par-4 18th, playing to a green framed by the clubhouse, is a classic finishing hole.",
      "The challenge comes from its length, strategic bunkering, and the ever-present wind that sweeps across the open property. It made history as the first public course in the Midwest to host the U.S. Open in 2017, won by Brooks Koepka. Golfers remember Erin Hills for its vast, natural scale, its firm and fast conditions that reward ground-game creativity, and its success as a modern, minimalist championship test accessible to all."
    ],
    "architect": "Donald Ross",
    "yardage": 7400,
    "continent": "North America",
    "latitude": 43.2511,
    "longitude": -88.2901
  },
  {
    "id": "pete-dye-gc",
    "name": "Pete Dye Golf Club",
    "description": "Pete Dye design in West Virginia",
    "location": "Bridgeport, West Virginia",
    "rating": 3.9,
    "category": "recent",
    "batch": null,
    "type": "parkland",
    "architect": "Pete Dye",
    "yardage": 7250,
    "continent": "North America",
    "latitude": 39.2865,
    "longitude": -80.2562
  },
  {
    "id": "greenbrier",
    "name": "The Greenbrier (Old White Course)",
    "description": "Historic resort course in West Virginia",
    "location": "White Sulphur Springs, West Virginia",
    "rating": 4.0,
    "category": "recommended",
    "batch": "Classic American Golden Age Designs",
    "type": "resort",
    "yardage": 6950,
    "continent": "North America",
    "latitude": 37.7962,
    "longitude": -80.2976
  },
  {
    "id": "homestead-cascades",
    "name": "The Homestead (Cascades Course)",
    "description": "Historic Virginia mountain course",
    "location": "Hot Springs, Virginia",
    "rating": 3.8,
    "category": "recent",
    "batch": "Classic American Golden Age Designs",
    "type": "mountain",
    "yardage": 6750,
    "continent": "North America",
    "latitude": 37.9996,
    "longitude": -79.8317
  },
  {
    "id": "kingsmill",
    "name": "Kingsmill Resort",
    "description": "Pete Dye design in Colonial Williamsburg",
    "location": "Williamsburg, Virginia",
    "rating": 3.7,
    "category": "recommended",
    "batch": null,
    "type": "parkland",
    "architect": "Pete Dye",
    "yardage": 6650,
    "continent": "North America",
    "latitude": 37.2707,
    "longitude": -76.7075
  },
  {
    "id": "golden-horseshoe",
    "name": "Golden Horseshoe Golf Club",
    "description": "Robert Trent Jones design in Williamsburg",
    "location": "Williamsburg, Virginia",
    "rating": 3.8,
    "category": "recent",
    "batch": null,
    "type": "parkland",
    "architect": "Robert Trent Jones",
    "yardage": 6850,
    "continent": "North America",
    "latitude": 37.2707,
    "longitude": -76.7075
  },
  {
    "id": "kiawah-river",
    "name": "Kiawah Island Golf Resort (River Course)",
    "description": "Tom Fazio design on Kiawah Island",
    "location": "Kiawah Island, South Carolina",
    "rating": 3.9,
    "category": "recommended",
    "batch": "Classic American Golden Age Designs",
    "type": "parkland",
    "architect": "Tom Fazio",
    "yardage": 6850,
    "continent": "North America",
    "latitude": 32.6083,
    "longitude": -80.0806
  },
  {
    "id": "wild-dunes",
    "name": "Wild Dunes Resort",
    "description": "Tom Fazio design near Charleston",
    "location": "Isle of Palms, South Carolina",
    "rating": 3.7,
    "category": "recent",
    "batch": "Premier Global Links & Sandbelt",
    "type": "parkland",
    "architect": "Tom Fazio",
    "yardage": 7300,
    "continent": "North America",
    "latitude": 32.7868,
    "longitude": -79.794
  },
  {
    "id": "kauri-cliffs",
    "name": "Kauri Cliffs Golf Course",
    "description": "Clifftop course in New Zealand",
    "location": "Matauri Bay, New Zealand",
    "rating": 4.5,
    "category": "recommended",
    "batch": null,
    "type": "coastal",
    "yardage": 7050,
    "continent": "Oceania",
    "latitude": -35.0333,
    "longitude": 173.9
  },
  {
    "id": "cape-kidnappers",
    "name": "Cape Kidnappers Golf Course",
    "description": "Dramatic clifftop course in New Zealand",
    "location": "Hawke's Bay, New Zealand",
    "rating": 4.4,
    "category": "recent",
    "batch": null,
    "type": "coastal",
    "yardage": 7000,
    "continent": "Oceania",
    "latitude": -39.4928,
    "longitude": 176.912
  },
  {
    "id": "tara-iti",
    "name": "Tara Iti Golf Club",
    "description": "Modern links course in New Zealand",
    "location": "Mangawhai, New Zealand",
    "rating": 4.6,
    "category": "recommended",
    "batch": null,
    "type": "links",
    "yardage": 7000,
    "continent": "Oceania",
    "latitude": -36.1333,
    "longitude": 174.5833,
    "isStudio": true,
    "hasStandardVersion": true,
    "studioFeatures": {
      "mappingType": "Lidar",
      "resolution": "True 4K Native",
      "physics": "Advanced Slope Engine",
      "accuracy": "Sub-Centimeter",
      "fileSize": "5 GB"
    },
    "standardFeatures": {
      "mappingType": "Satellite",
      "resolution": "HD (1080p)",
      "physics": "Standard Terrain Model",
      "accuracy": "1m",
      "fileSize": "500 MB"
    }
  },
  {
    "id": "barnbougle-dunes",
    "name": "Barnbougle Dunes Golf Links",
    "description": "Links course in Tasmania",
    "location": "Bridport, Tasmania",
    "rating": 4.3,
    "category": "recent",
    "batch": "Premier Global Links & Sandbelt",
    "type": "links",
    "yardage": 7450,
    "continent": "Unknown",
    "latitude": -41.0,
    "longitude": 147.4
  },
  {
    "id": "king-island",
    "name": "King Island Golf Club",
    "description": "Remote links course in Bass Strait",
    "location": "King Island, Tasmania",
    "rating": 4.1,
    "category": "recommended",
    "batch": "Classic American Golden Age Designs",
    "type": "links",
    "yardage": 6800,
    "continent": "Unknown",
    "latitude": -39.8333,
    "longitude": 143.8333
  },
  {
    "id": "valderrama",
    "name": "Valderrama Golf Club",
    "description": "Exclusive championship course that hosted the 1997 Ryder Cup",
    "location": "Sotogrande, Spain",
    "rating": 4.7,
    "category": "recommended",
    "batch": "Modern American Icons & Stadium Courses",
    "type": "championship",
    "architect": "Robert Trent Jones Sr.",
    "established": 1974,
    "yardage": 7000,
    "continent": "Europe",
    "blurb": [
      "Located in the sun-drenched hills of Sotogrande, Spain, Valderrama is Robert Trent Jones Sr.'s 1974 masterpiece, famously tightened and refined by the club in the 1980s. Its character is defined by incredibly narrow, tree-lined fairways of cork oak, small, fiercely guarded greens, and immaculate, green-tinted sand in its strategic bunkers. The par-5 17th, with its creek-guarded layup and two-tiered green, is one of Europe's most famous risk-reward holes, having decided the fate of the 1997 Ryder Cup.",
      "The experience is one of intense precision and strategy, where position off every tee is non-negotiable. The heavy, clay-based soil can play surprisingly firm and fast. As the perennial host of the Volvo Masters and the seminal 1997 Ryder Cup—the first held on continental Europe—it cemented its reputation as the continent's premier championship test. Golfers remember it for its flawless, demanding conditioning and the claustrophobic pressure of threading shots through its iconic, arboreal corridors."
    ],
    "latitude": 36.2833,
    "longitude": -5.2833
  },
  {
    "id": "le-golf-national",
    "name": "Le Golf National (Albatros Course)",
    "description": "Stadium-style championship course that hosted the 2018 Ryder Cup",
    "location": "Paris, France",
    "rating": 4.5,
    "category": "recommended",
    "batch": "Modern American Icons & Stadium Courses",
    "type": "championship",
    "architect": "Hubert Chesneau",
    "established": 1990,
    "yardage": 7200,
    "continent": "Europe",
    "blurb": [
      "Built for the 1991 French Open and now its permanent home, the Albatros Course near Paris is a modern, stadium-style design by Hubert Chesneau and Robert Von Hagge. Its character is defined by vast, sculpted lakes and winding streams that come into play on 14 holes, creating a dramatic, risk-reward spectacle. The final four holes, known as \"The Finish,\" are a brutal and thrilling amphitheater, with water menacing every shot into the par-3 16th and the long, watery par-4 18th.",
      "Playing here is a test of nerve and execution under pressure, designed to create drama for spectators. The rough is thick, and the wind can whip across the open property. It achieved global fame by hosting the epic 2018 Ryder Cup, where the European team's mastery of its perils was decisive. Golfers remember Le Golf National for its unapologetically modern, penal design and the electric atmosphere of its stadium layout, a stark contrast to Europe's classic heathland and links courses."
    ],
    "latitude": 48.8566,
    "longitude": 2.3522
  },
  {
    "id": "morfontaine",
    "name": "Morfontaine Golf Club",
    "description": "Classic heathland course by Tom Simpson, one of France's finest",
    "location": "Mortefontaine, France",
    "rating": 4.6,
    "category": "recommended",
    "batch": "Strategic & Artistic Gems",
    "type": "parkland",
    "architect": "Tom Simpson",
    "established": 1927,
    "yardage": 6800,
    "continent": "Europe",
    "blurb": [
      "Hidden in the forest of Chantilly, Tom Simpson's 1927 design is considered the most beautiful and natural heathland course in France, if not all of Europe. The routing is a work of genius, flowing seamlessly through a secluded forest of pine, birch, and heather without a single weak hole. Its character is defined by wild, undulating fairways, exquisitely shaped bunkers that blend into the landscape, and brilliantly contoured greens that demand imaginative approach play.",
      "The experience is one of pure, serene, and strategic golf on fast-running, sandy soil. There are no housing developments or distractions—only the game and the forest. Its exclusivity and perfection have earned it a cult-like reverence among global architecture aficionados. Golfers remember Morfontaine for its sublime tranquility, the flawless harmony between the course and its natural setting, and the feeling of playing a perfectly preserved work of art from the golden age of design."
    ],
    "latitude": 49.1167,
    "longitude": 2.6
  },
  {
    "id": "oitavos-dunes",
    "name": "Oitavos Dunes",
    "description": "Links-style course on Portugal's Atlantic coast",
    "location": "Cascais, Portugal",
    "rating": 4.4,
    "category": "recommended",
    "batch": "Premier Global Links & Sandbelt",
    "type": "links",
    "architect": "Arthur Hills",
    "established": 2001,
    "yardage": 7100,
    "continent": "Europe",
    "blurb": [
      "Nestled within a protected natural park in Cascais, Portugal, Arthur Hills' 2001 design is a stunning and sustainable links-style course. It plays over rolling, sandy terrain covered in native dunes vegetation with constant, panoramic views of the Atlantic Ocean and the Sintra mountains. The par-4 6th, playing along an oceanfront cliff, and the long, demanding par-4 18th back to the modernist clubhouse are standout holes that encapsulate its scenic and challenging character.",
      "The experience is defined by the strong coastal winds and firm, fast conditions that reward the ground game. Environmental stewardship is paramount, with minimal irrigation and a focus on native flora. It has hosted the Portuguese Open multiple times, showcasing its championship quality. Golfers remember Oitavos for its breathtaking natural beauty, its eco-friendly ethos, and the rare gift of a true, walkable links experience under the reliable sun of the Iberian coast."
    ],
    "latitude": 38.6979,
    "longitude": -9.4215
  },
  {
    "id": "praia-del-rey",
    "name": "Praia d'El Rey Golf & Beach Resort",
    "description": "Scenic oceanfront course with dramatic Atlantic views",
    "location": "Óbidos, Portugal",
    "rating": 4.3,
    "category": "recommended",
    "batch": "Destination & Scenic Resort Courses",
    "type": "coastal",
    "architect": "Cabell Robinson",
    "established": 1997,
    "yardage": 7000,
    "continent": "Europe",
    "latitude": 39.3611,
    "longitude": -9.1572
  },
  {
    "id": "chantilly-vineuil",
    "name": "Golf de Chantilly (Vineuil Course)",
    "description": "Classic Tom Simpson design that has hosted the French Open",
    "location": "Chantilly, France",
    "rating": 4.5,
    "category": "recommended",
    "batch": "Classic American Golden Age Designs",
    "type": "parkland",
    "architect": "Tom Simpson",
    "established": 1909,
    "yardage": 6900,
    "continent": "Europe",
    "blurb": [
      "Located in the historic heart of French golf near the Château de Chantilly, the Vineuil Course is a classic 1909 Tom Simpson design built on perfect sandy soil. It is a quintessential heathland masterpiece, featuring tree-lined fairways, majestic stands of oak and pine, and strategic bunkering that frames each hole beautifully. The opening stretch, particularly the par-4 2nd and 3rd, and the challenging finish are revered for their strategic demands and timeless beauty.",
      "Playing Chantilly is a walk through history, with a refined, traditional atmosphere. The course demands thoughtful positioning and precise iron play to its subtly contoured greens. It has hosted the French Open more than a dozen times, testing legends from Henry Cotton to Seve Ballesteros. Golfers remember it for its elegant, parkland beauty, its strategic sophistication, and the palpable sense of playing one of continental Europe's most historic and dignified championship venues."
    ],
    "latitude": 49.1944,
    "longitude": 2.4714
  },
  {
    "id": "finca-cortesin",
    "name": "Finca Cortesin Golf Club",
    "description": "Modern championship course in Andalusia, Spain",
    "location": "Casares, Spain",
    "rating": 4.6,
    "category": "recommended",
    "batch": "Modern American Icons & Stadium Courses",
    "type": "championship",
    "architect": "Cabell Robinson",
    "established": 2006,
    "yardage": 7100,
    "continent": "Europe",
    "latitude": 36.4447,
    "longitude": -5.2739
  },
  {
    "id": "real-club-valderrama",
    "name": "Real Club Valderrama",
    "description": "Prestigious Spanish course, host of multiple European Tour events",
    "location": "Sotogrande, Spain",
    "rating": 4.7,
    "category": "recommended",
    "batch": "Modern American Icons & Stadium Courses",
    "type": "championship",
    "architect": "Robert Trent Jones Sr.",
    "established": 1974,
    "yardage": 6950,
    "continent": "Europe",
    "latitude": 36.2833,
    "longitude": -5.2833
  },
  {
    "id": "hirono",
    "name": "Hirono Golf Club",
    "description": "Classic C.H. Alison design, one of Japan's most revered courses",
    "location": "Kobe, Japan",
    "rating": 4.8,
    "category": "recommended",
    "batch": "Classic American Golden Age Designs",
    "type": "parkland",
    "architect": "C.H. Alison",
    "established": 1932,
    "yardage": 7050,
    "continent": "Asia",
    "blurb": [
      "Often called \"The Pine Valley of the East,\" Hirono in Kobe is C.H. Alison's 1932 masterpiece and Japan's undisputed architectural crown jewel. Carved through dense pine forests and dramatic, rugged valleys, the course features dramatic elevation changes, deep, penal bunkers, and brilliantly sited greens. The par-4 7th, descending into a valley, and the perilous par-3 11th over a deep ravine are world-class holes that define its challenging and majestic character.",
      "The experience is one of awe and rigorous examination, where accuracy and strategy are paramount on every shot. The club maintains an atmosphere of profound tradition and reverence for the game. Consistently ranked as the number one course in Japan, its influence on Asian golf is immeasurable. Golfers remember Hirono for its perfect fusion of breathtaking natural terrain with Alison's bold, strategic design, creating a secluded and unforgettable pilgrimage."
    ],
    "latitude": 34.6901,
    "longitude": 135.1956
  },
  {
    "id": "kasumigaseki-east",
    "name": "Kasumigaseki Country Club (East Course)",
    "description": "Historic Japanese course that hosted the 2020 Olympics",
    "location": "Saitama, Japan",
    "rating": 4.6,
    "category": "recommended",
    "batch": "Historic & Championship International Links",
    "type": "championship",
    "architect": "Kinya Fujita",
    "established": 1929,
    "yardage": 7150,
    "continent": "Asia",
    "blurb": [
      "The East Course, a 1929 Kinya Fujita design later renovated by Tom and Logan Fazio, is a classic, tree-lined parkland that became the center of the golf world during the 2020 Olympics. Its character blends traditional Japanese golf with modern championship refinements, featuring strategic bunkering, subtly contoured greens, and beautiful stands of Japanese zelkova and pine trees. The risk-reward par-5 18th, with its creek-crossing approach, provided a dramatic finale for the Olympic competition.",
      "Playing Kasumigaseki is a test of precision and course management on impeccably groomed surfaces. The course's ability to challenge the world's best while remaining fair was proven during the Olympic events. As one of Japan's most historic clubs, it has hosted numerous Japan Opens. Golfers remember it for its dignified atmosphere, its flawless conditioning, and its place in history as the stage where Xander Schauffele and Nelly Korda won Olympic gold."
    ],
    "latitude": 35.8617,
    "longitude": 139.6455
  },
  {
    "id": "naruo",
    "name": "Naruo Golf Club",
    "description": "Traditional Japanese course by C.H. Alison",
    "location": "Osaka, Japan",
    "rating": 4.5,
    "category": "recommended",
    "batch": "Classic American Golden Age Designs",
    "type": "parkland",
    "architect": "C.H. Alison",
    "established": 1930,
    "yardage": 6900,
    "continent": "Asia",
    "latitude": 34.6937,
    "longitude": 135.5023
  },
  {
    "id": "nine-bridges",
    "name": "Nine Bridges",
    "description": "Modern championship course on Jeju Island, host of CJ Cup",
    "location": "Jeju Island, South Korea",
    "rating": 4.7,
    "category": "recommended",
    "batch": "Modern American Icons & Stadium Courses",
    "type": "championship",
    "architect": "Ronald Fream",
    "established": 2001,
    "yardage": 7200,
    "continent": "Asia",
    "blurb": [
      "Located on the volcanic island of Jeju, Nine Bridges is a stunning 2001 design by Ronald Fream and David Dale that masterfully incorporates natural and man-made elements. The front nine plays through a rugged, wooded valley, while the back nine opens to dramatic vistas with large lakes and rock formations. Its signature is the par-3 16th, featuring a green on a peninsula in a lake, and the par-5 18th, which plays around water back to the iconic clubhouse.",
      "The experience blends resort luxury with a serious, strategic championship test. The wind is a constant factor, and the course conditions are perpetually pristine. It has hosted the PGA Tour's CJ Cup for multiple years, introducing its quality to a global audience. Golfers remember Nine Bridges for its dramatic beauty, the seamless blend of its two distinct nines, and its status as the flagship course of Korean golf."
    ],
    "latitude": 33.4996,
    "longitude": 126.5312
  },
  {
    "id": "club-nine-bridges",
    "name": "The Club at Nine Bridges",
    "description": "Scenic mountain course on Jeju Island",
    "location": "Jeju Island, South Korea",
    "rating": 4.5,
    "category": "recommended",
    "batch": "Destination & Scenic Resort Courses",
    "type": "mountain",
    "architect": "Ronald Fream",
    "established": 2001,
    "yardage": 7100,
    "continent": "Asia",
    "latitude": 33.4996,
    "longitude": 126.5312
  },
  {
    "id": "mission-hills-world-cup",
    "name": "Mission Hills Golf Club (World Cup Course)",
    "description": "Jack Nicklaus design that hosted the World Cup",
    "location": "Shenzhen, China",
    "rating": 4.4,
    "category": "recommended",
    "batch": "Modern American Icons & Stadium Courses",
    "type": "championship",
    "architect": "Jack Nicklaus",
    "established": 1994,
    "yardage": 7300,
    "continent": "Asia",
    "latitude": 22.5431,
    "longitude": 114.0579
  },
  {
    "id": "siam-old",
    "name": "Siam Country Club (Old Course)",
    "description": "Classic Thai course that has hosted LPGA events",
    "location": "Pattaya, Thailand",
    "rating": 4.3,
    "category": "recommended",
    "batch": "Destination & Scenic Resort Courses",
    "type": "parkland",
    "architect": "Ichizo Kato",
    "established": 1971,
    "yardage": 7000,
    "continent": "Asia",
    "latitude": 12.9236,
    "longitude": 100.8825
  },
  {
    "id": "alpine-golf",
    "name": "Alpine Golf Club",
    "description": "Championship course in Thailand with strategic design",
    "location": "Pathum Thani, Thailand",
    "rating": 4.4,
    "category": "recommended",
    "batch": "Modern American Icons & Stadium Courses",
    "type": "championship",
    "architect": "Schmidt-Curley Design",
    "established": 1996,
    "yardage": 7100,
    "continent": "Asia",
    "latitude": 14.0208,
    "longitude": 100.5253
  },
  {
    "id": "leopard-creek",
    "name": "Leopard Creek Country Club",
    "description": "Gary Player design bordering Kruger National Park",
    "location": "Mpumalanga, South Africa",
    "rating": 4.6,
    "category": "recommended",
    "batch": "Destination & Scenic Resort Courses",
    "type": "parkland",
    "architect": "Gary Player",
    "established": 1996,
    "yardage": 7000,
    "continent": "Africa",
    "blurb": [
      "Designed by Gary Player and situated on the southern border of Kruger National Park, Leopard Creek offers a truly unique safari-golf experience. The course is strategically routed to provide breathtaking views of the Crocodile River and the African bush beyond, with animals often visible from the fairways. Its most famous hole is the par-5 13th, where the green juts into the river, protected by the \"Crocodile Trap\" bunker, offering a direct view into the national park.",
      "The experience is one of immersive wildlife and nature, combined with a challenging and beautifully maintained parkland layout. Sophisticated fencing and landscaping allow wildlife to roam nearby while protecting the course. It hosts the Alfred Dunhill Championship, a flagship event on the European Tour. Golfers remember Leopard Creek not just for the quality of the golf, but for the unforgettable sensation of playing a round accompanied by the sights and sounds of the African wilderness."
    ],
    "latitude": -25.5653,
    "longitude": 30.5279
  },
  {
    "id": "fancourt-links",
    "name": "Fancourt (Links Course)",
    "description": "Gary Player design that hosted the Presidents Cup",
    "location": "George, South Africa",
    "rating": 4.7,
    "category": "recommended",
    "batch": "Premier Global Links & Sandbelt",
    "type": "links",
    "architect": "Gary Player",
    "established": 2000,
    "yardage": 7200,
    "continent": "Africa",
    "blurb": [
      "Gary Player's 2000 design in George, South Africa, is a monumental and controversial masterpiece—a manufactured links built on reclaimed farmland. With no ocean in sight, it mimics the classic links through vast, rolling fairways, deep pot bunkers, towering dunes covered in fescue, and enormous, double greens. The finish, particularly the par-4 17th (\"The Rumble\") and par-3 18th, is as demanding and dramatic as any in world golf.",
      "The experience is a windswept, walking-only test of power, patience, and creativity. It is a relentless challenge that polarizes opinion but commands respect. It famously hosted the 2003 Presidents Cup, which ended in a dramatic tie. Golfers remember The Links at Fancourt for its sheer audacity and scale, its incredible conditioning, and the surreal achievement of creating a truly authentic linksland experience far from any coast."
    ],
    "latitude": -33.9581,
    "longitude": 22.4614
  },
  {
    "id": "arabella",
    "name": "Arabella Golf Club",
    "description": "Scenic coastal course with mountain views",
    "location": "Kleinmond, South Africa",
    "rating": 4.4,
    "category": "recommended",
    "batch": "Destination & Scenic Resort Courses",
    "type": "coastal",
    "architect": "Peter Matkovich",
    "established": 1999,
    "yardage": 6900,
    "continent": "Africa",
    "latitude": -34.3333,
    "longitude": 19.0167
  },
  {
    "id": "gary-player-country-club",
    "name": "Gary Player Country Club",
    "description": "Championship course that hosts the Nedbank Golf Challenge",
    "location": "Sun City, South Africa",
    "rating": 4.5,
    "category": "recommended",
    "batch": "Modern American Icons & Stadium Courses",
    "type": "championship",
    "architect": "Gary Player",
    "established": 1979,
    "yardage": 7100,
    "continent": "Africa",
    "latitude": -25.3307,
    "longitude": 27.0967
  },
  {
    "id": "cabot-cliffs",
    "name": "Cabot Cliffs",
    "description": "Coore & Crenshaw design with dramatic coastal views",
    "location": "Inverness, Nova Scotia, Canada",
    "rating": 4.8,
    "category": "recommended",
    "batch": "Premier Global Links & Sandbelt",
    "type": "coastal",
    "architect": "Bill Coore",
    "established": 2015,
    "yardage": 7100,
    "continent": "North America",
    "blurb": [
      "The 2015 Coore & Crenshaw design in Inverness, Nova Scotia, is a modern marvel of dramatic coastal golf. Perched on towering cliffs high above the Gulf of St. Lawrence, the routing delivers a succession of breathtaking ocean vistas. The back nine is legendary, featuring the cliff-edge par-4 15th, the iconic par-3 16th over a chasm, and the risk-reward par-4 17th that dares players to cut off the corner of the sea.",
      "Playing Cabot Cliffs is an exhilarating walk through some of the most dramatic scenery in golf, where the wind dictates every shot. The firm, fescue-covered ground encourages creative play. Since opening, it has skyrocketed to the top of global course rankings. Golfers remember it for its awe-inspiring beauty, the thrilling, strategic design of its cliffside holes, and its instant-classic status as a must-play pilgrimage site."
    ],
    "latitude": 46.2287,
    "longitude": -61.3086,
    "isStudio": true,
    "hasStandardVersion": true,
    "studioFeatures": {
      "mappingType": "Lidar",
      "resolution": "True 4K Native",
      "physics": "Advanced Slope Engine",
      "accuracy": "Sub-Centimeter",
      "fileSize": "5 GB"
    },
    "standardFeatures": {
      "mappingType": "Satellite",
      "resolution": "HD (1080p)",
      "physics": "Standard Terrain Model",
      "accuracy": "1m",
      "fileSize": "500 MB"
    }
  },
  {
    "id": "cabot-links",
    "name": "Cabot Links",
    "description": "Authentic links experience on Canada's Atlantic coast",
    "location": "Inverness, Nova Scotia, Canada",
    "rating": 4.7,
    "category": "recommended",
    "batch": "Premier Global Links & Sandbelt",
    "type": "links",
    "architect": "Rod Whitman",
    "established": 2011,
    "yardage": 7000,
    "continent": "North America",
    "latitude": 46.2287,
    "longitude": -61.3086
  },
  {
    "id": "st-georges-toronto",
    "name": "St. George's Golf and Country Club",
    "description": "Classic Stanley Thompson design, host of Canadian Open",
    "location": "Toronto, Canada",
    "rating": 4.6,
    "category": "recommended",
    "batch": "Classic American Golden Age Designs",
    "type": "parkland",
    "architect": "Stanley Thompson",
    "established": 1929,
    "yardage": 6950,
    "continent": "North America",
    "blurb": [
      "Stanley Thompson's 1929 design in Toronto is a classic, rolling parkland and the architectural heart of Canadian golf. Built on the sandy, rolling terrain of the Humber River Valley, it features Thompson's signature bold bunkering, strategic use of natural landforms, and brilliantly contoured greens. The par-3 3rd (\"The Vault\") over a deep valley and the par-4 13th are standout examples of his genius for creating dramatic, memorable holes.",
      "The experience is one of traditional, strategic golf on a walkable, beautifully treed property. It has hosted the Canadian Open six times, most recently in 2010, where it was praised for challenging the modern professional game. Golfers remember St. George's for its timeless design, its superb conditioning, and its role as a beloved, classic test that has shaped golf in Canada for nearly a century."
    ],
    "latitude": 43.6532,
    "longitude": -79.3832
  },
  {
    "id": "hamilton-gcc",
    "name": "Hamilton Golf and Country Club",
    "description": "Harry Colt design that has hosted the Canadian Open",
    "location": "Ancaster, Canada",
    "rating": 4.5,
    "category": "recommended",
    "batch": "Classic American Golden Age Designs",
    "type": "parkland",
    "architect": "Harry Colt",
    "established": 1914,
    "yardage": 7000,
    "continent": "North America",
    "latitude": 43.2181,
    "longitude": -79.9828
  },
  {
    "id": "el-camaleon",
    "name": "El Camaleón Golf Club",
    "description": "Greg Norman design that hosts the Mayakoba Classic",
    "location": "Playa del Carmen, Mexico",
    "rating": 4.4,
    "category": "recommended",
    "batch": "Modern American Icons & Stadium Courses",
    "type": "championship",
    "architect": "Greg Norman",
    "established": 2006,
    "yardage": 7000,
    "continent": "North America",
    "latitude": 20.6296,
    "longitude": -87.0731
  },
  {
    "id": "punta-espada",
    "name": "Punta Espada Golf Club",
    "description": "Jack Nicklaus design with dramatic oceanfront holes",
    "location": "Cap Cana, Dominican Republic",
    "rating": 4.6,
    "category": "recommended",
    "batch": "Destination & Scenic Resort Courses",
    "type": "coastal",
    "architect": "Jack Nicklaus",
    "established": 2006,
    "yardage": 7100,
    "continent": "North America",
    "blurb": [
      "The first of Jack Nicklaus's three courses at Cap Cana in the Dominican Republic, Punta Espada (2006) is a breathtaking oceanfront spectacle. Eight holes play directly along or over the turquoise waters of the Caribbean Sea, with forced carries from the tee creating thrilling risk-reward decisions. The signature par-3 13th, requiring a full carry over a bay to a cliffside green, is one of the most photographed and exhilarating one-shotters in the world.",
      "The experience is defined by stunning visuals, luxury, and target golf, where precision is rewarded and mistakes are amplified by the sea. The course conditions are immaculate, with paspalum turf thriving in the coastal environment. It has hosted a PGA Tour Champions event for many years. Golfers remember Punta Espada for its jaw-dropping beauty, the sheer number of dramatic ocean carries, and the feeling of playing a high-stakes, resort-style masterpiece."
    ],
    "latitude": 18.5667,
    "longitude": -68.3667
  },
  {
    "id": "corales",
    "name": "Corales Golf Club",
    "description": "Tom Fazio design with stunning Caribbean views",
    "location": "Punta Cana, Dominican Republic",
    "rating": 4.5,
    "category": "recommended",
    "batch": "Destination & Scenic Resort Courses",
    "type": "coastal",
    "architect": "Tom Fazio",
    "established": 2010,
    "yardage": 7050,
    "continent": "North America",
    "blurb": [
      "Tom Fazio's 2010 design at Puntacana Resort is a dramatic and visually stunning course that culminates in a legendary finishing stretch known as \"The Devil's Elbow.\" The course plays along rugged cliffs, natural coral quarries, and coves of the Caribbean Sea. The final three holes—the perilous par-4 16th along the water, the par-3 17th over the ocean, and the par-4 18th requiring a bold carry over the cliff-edge bay—are as dramatic a finish as exists in golf.",
      "The play experience emphasizes strategy and shot-making, with wide fairways giving way to demanding approach shots. The wind is a constant and shaping force. It now hosts the PGA Tour's Corales Puntacana Championship. Golfers remember Corales for its rugged, natural beauty, its exceptional Fazio design that builds to an unforgettable climax, and its status as a stern championship test in a paradise setting."
    ],
    "latitude": 18.5819,
    "longitude": -68.3686
  },
  {
    "id": "royal-adelaide",
    "name": "Royal Adelaide Golf Club",
    "description": "Alister MacKenzie design, classic Australian sandbelt course",
    "location": "Adelaide, Australia",
    "rating": 4.7,
    "category": "recommended",
    "batch": "Premier Global Links & Sandbelt",
    "type": "sandbelt",
    "architect": "Alister MacKenzie",
    "established": 1892,
    "yardage": 6900,
    "continent": "Oceania",
    "blurb": [
      "Dr. Alister MacKenzie's 1926 design in the sandbelt of Adelaide is a quintessential Australian masterpiece, later refined by C.H. Alison. The course is famed for its strategic brilliance and the iconic \"Crater\" bunker complex on the par-4 3rd hole, where the fairway passes between two massive, cross-bunkers. The routing creatively incorporates the coastal dunes and the historic Glanville railway line, which runs through the property.",
      "Playing Royal Adelaide is a lesson in strategic ground-game golf on fast-running, sandy soil. The bunkering is both artistic and penal, and the greens are subtly contoured. It has hosted the Australian Open numerous times, crowning champions like Gary Player and Jordan Spieth. Golfers remember it for its timeless, cerebral design, its perfect integration with the natural sandbelt landscape, and its welcoming, traditional club atmosphere."
    ],
    "latitude": -34.9285,
    "longitude": 138.6007
  },
  {
    "id": "new-south-wales",
    "name": "New South Wales Golf Club",
    "description": "Alister MacKenzie design with dramatic clifftop setting",
    "location": "La Perouse, Australia",
    "rating": 4.8,
    "category": "recommended",
    "batch": "Premier Global Links & Sandbelt",
    "type": "coastal",
    "architect": "Alister MacKenzie",
    "established": 1926,
    "yardage": 7100,
    "continent": "Oceania",
    "blurb": [
      "Perched on the rugged, wind-swept headland at La Perouse in Sydney, this Alister MacKenzie design (with later work by Eric Apperly and others) is one of the world's most spectacular clifftop links. The course offers panoramic views of Botany Bay, the Pacific Ocean, and the city skyline. The stretch from the par-4 4th to the par-3 6th plays along the cliff's edge, with the ocean a constant companion and hazard.",
      "The experience is defined by the powerful, often gale-force winds that sweep across the exposed headland, demanding creativity and resilience. The conditions are firm and fast, true to its links character. It consistently ranks among the world's top courses for its unparalleled setting and thrilling test. Golfers remember New South Wales for its raw, breathtaking beauty, the exhilarating challenge of its cliffside holes, and the feeling of playing golf on the very edge of the continent."
    ],
    "latitude": -33.9894,
    "longitude": 151.2306
  },
  {
    "id": "cape-kidnappers-nz",
    "name": "Cape Kidnappers",
    "description": "Tom Doak design with dramatic clifftop holes",
    "location": "Hawke's Bay, New Zealand",
    "rating": 4.7,
    "category": "recommended",
    "batch": "Destination & Scenic Resort Courses",
    "type": "coastal",
    "architect": "Tom Doak",
    "established": 2004,
    "yardage": 7000,
    "continent": "Oceania",
    "latitude": -39.4928,
    "longitude": 176.912
  }
]